{
  "type": "bundle",
  "id": "bundle--0e80709c-a2c8-4b54-9769-562f1d0405ef",
  "spec_version": "2.0",
  "objects": [
    {
      "type": "report",
      "id": "report--0e80709c-a2c8-4b54-9769-562f1d0405ef",
      "created": "2019-05-01T15:51:04.377Z",
      "modified": "2020-07-30T16:55:40.805Z",
      "name": "Th3Bug",
      "description": "Threat Group focusing on Energy, Chemical Industry, Healthcare and Pharma industries. Nitro is known for targeted spear phishing campaigns and using Poison Ivy malware. ",
      "published": "2020-07-30T16:55:40.805Z",
      "object_refs": [
        "intrusion-set--90ba5c1f-2704-487c-8da9-523fcd023d5a",
        "report--352e36e2-33ad-4065-a080-f13778ce9593"
      ],
      "labels": [
        "intrusion-set"
      ]
    },
    {
      "type": "intrusion-set",
      "id": "intrusion-set--90ba5c1f-2704-487c-8da9-523fcd023d5a",
      "created": "2019-05-01T15:51:07.709Z",
      "modified": "2019-07-25T12:33:21.155Z",
      "name": "Th3Bug"
    },
    {
      "type": "attack-pattern",
      "id": "attack-pattern--42e8de7b-37b2-4258-905a-6897815e58e0",
      "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
      "created": "2017-05-31T21:30:38.511Z",
      "modified": "2021-04-24T13:24:45.840Z",
      "name": "T1036: Masquerading",
      "description": "Adversaries may attempt to manipulate features of their artifacts to make them appear legitimate or benign to users and/or security tools. Masquerading occurs when the name or location of an object, legitimate or malicious, is manipulated or abused for the sake of evading defenses and observation. This may include manipulating file metadata, tricking users into misidentifying the file type, and giving legitimate task or service names.\n\nRenaming abusable system utilities to evade security monitoring is also a form of [Masquerading](https://attack.mitre.org/techniques/T1036).(Citation: LOLBAS Main Site)",
      "kill_chain_phases": [
        {
          "kill_chain_name": "lockheed",
          "phase_name": "installation"
        },
        {
          "kill_chain_name": "mitre-attack",
          "phase_name": "defense-evasion"
        }
      ],
      "external_references": [
        {
          "source_name": "mitre-attack",
          "url": "https://attack.mitre.org/techniques/T1036",
          "external_id": "T1036"
        },
        {
          "source_name": "capec",
          "url": "https://capec.mitre.org/data/definitions/177.html",
          "external_id": "CAPEC-177"
        },
        {
          "source_name": "LOLBAS Main Site",
          "url": "https://lolbas-project.github.io/",
          "description": "LOLBAS. (n.d.). Living Off The Land Binaries and Scripts (and also Libraries). Retrieved February 10, 2020."
        },
        {
          "source_name": "Elastic Masquerade Ball",
          "url": "http://pages.endgame.com/rs/627-YBU-612/images/EndgameJournal_The%20Masquerade%20Ball_Pages_R2.pdf",
          "description": "Ewing, P. (2016, October 31). How to Hunt: The Masquerade Ball. Retrieved October 31, 2016."
        },
        {
          "source_name": "Twitter ItsReallyNick Masquerading Update",
          "url": "https://twitter.com/ItsReallyNick/status/1055321652777619457",
          "description": "Carr, N.. (2018, October 25). Nick Carr Status Update Masquerading. Retrieved April 22, 2019."
        }
      ],
      "object_marking_refs": [
        "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
      ],
      "x_mitre_detection": "Collect file hashes; file names that do not match their expected hash are suspect. Perform file monitoring; files with known names but in unusual locations are suspect. Likewise, files that are modified outside of an update or patch are suspect.\n\nIf file names are mismatched between the file name on disk and that of the binary's PE metadata, this is a likely indicator that a binary was renamed after it was compiled. Collecting and comparing disk and resource filenames for binaries by looking to see if the InternalName, OriginalFilename, and/or ProductName match what is expected could provide useful leads, but may not always be indicative of malicious activity. (Citation: Elastic Masquerade Ball) Do not focus on the possible names a file could have, but instead on the command-line arguments that are known to be used and are distinct because it will have a better rate of detection.(Citation: Twitter ItsReallyNick Masquerading Update)\n\nLook for indications of common characters that may indicate an attempt to trick users into misidentifying the file type, such as a space as the last character of a file name or the right-to-left override characters\"\\u202E\", \"[U+202E]\", and \"%E2%80%AE”.",
      "x_mitre_platforms": [
        "Containers",
        "Linux",
        "macOS",
        "Windows"
      ],
      "x_mitre_data_sources": [
        "Command: Command Execution",
        "File: File Metadata",
        "File: File Modification",
        "Image: Image Metadata",
        "Process: Process Metadata",
        "Scheduled Job: Scheduled Job Metadata",
        "Scheduled Job: Scheduled Job Modification",
        "Service: Service Creation",
        "Service: Service Metadata"
      ],
      "x_mitre_is_subtechnique": false,
      "x_mitre_defense_bypassed": [
        "Application control by file name or path"
      ],
      "x_mitre_contributors": [
        "Bartosz Jerzman",
        "David Lu, Tripwire",
        "Elastic",
        "Felipe Espósito, @Pr0teus",
        "Nick Carr, FireEye",
        "Oleg Kolesnikov, Securonix"
      ],
      "x_mitre_version": "1.4"
    },
    {
      "type": "attack-pattern",
      "id": "attack-pattern--d742a578-d70e-4d0e-96a6-02a9c30204e6",
      "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
      "created": "2018-04-18T17:59:24.739Z",
      "modified": "2020-03-29T23:48:15.056Z",
      "name": "T1189: Drive-by Compromise",
      "description": "Adversaries may gain access to a system through a user visiting a website over the normal course of browsing. With this technique, the user's web browser is typically targeted for exploitation, but adversaries may also use compromised websites for non-exploitation behavior such as acquiring [Application Access Token](https://attack.mitre.org/techniques/T1550/001).\n\nMultiple ways of delivering exploit code to a browser exist, including:\n\n* A legitimate website is compromised where adversaries have injected some form of malicious code such as JavaScript, iFrames, and cross-site scripting.\n* Malicious ads are paid for and served through legitimate ad providers.\n* Built-in web application interfaces are leveraged for the insertion of any other kind of object that can be used to display web content or contain a script that executes on the visiting client (e.g. forum posts, comments, and other user controllable web content).\n\nOften the website used by an adversary is one visited by a specific community, such as government, a particular industry, or region, where the goal is to compromise a specific user or set of users based on a shared interest. This kind of targeted attack is referred to a strategic web compromise or watering hole attack. There are several known examples of this occurring.(Citation: Shadowserver Strategic Web Compromise)\n\nTypical drive-by compromise process:\n\n1. A user visits a website that is used to host the adversary controlled content.\n2. Scripts automatically execute, typically searching versions of the browser and plugins for a potentially vulnerable version. \n    * The user may be required to assist in this process by enabling scripting or active website components and ignoring warning dialog boxes.\n3. Upon finding a vulnerable version, exploit code is delivered to the browser.\n4. If exploitation is successful, then it will give the adversary code execution on the user's system unless other protections are in place.\n    * In some cases a second visit to the website after the initial scan is required before exploit code is delivered.\n\nUnlike [Exploit Public-Facing Application](https://attack.mitre.org/techniques/T1190), the focus of this technique is to exploit software on a client endpoint upon visiting a website. This will commonly give an adversary access to systems on the internal network instead of external systems that may be in a DMZ.\n\nAdversaries may also use compromised websites to deliver a user to a malicious application designed to [Steal Application Access Token](https://attack.mitre.org/techniques/T1528)s, like OAuth tokens, to gain access to protected applications and information. These malicious applications have been delivered through popups on legitimate websites.(Citation: Volexity OceanLotus Nov 2017)",
      "kill_chain_phases": [
        {
          "kill_chain_name": "lockheed",
          "phase_name": "delivery"
        },
        {
          "kill_chain_name": "mitre-attack",
          "phase_name": "initial-access"
        }
      ],
      "external_references": [
        {
          "source_name": "mitre-attack",
          "url": "https://attack.mitre.org/techniques/T1189",
          "external_id": "T1189"
        },
        {
          "source_name": "Shadowserver Strategic Web Compromise",
          "url": "http://blog.shadowserver.org/2012/05/15/cyber-espionage-strategic-web-compromises-trusted-websites-serving-dangerous-results/",
          "description": "Adair, S., Moran, N. (2012, May 15). Cyber Espionage & Strategic Web Compromises – Trusted Websites Serving Dangerous Results. Retrieved March 13, 2018."
        },
        {
          "source_name": "Volexity OceanLotus Nov 2017",
          "url": "https://www.volexity.com/blog/2017/11/06/oceanlotus-blossoms-mass-digital-surveillance-and-exploitation-of-asean-nations-the-media-human-rights-and-civil-society/",
          "description": "Lassalle, D., et al. (2017, November 6). OceanLotus Blossoms: Mass Digital Surveillance and Attacks Targeting ASEAN, Asian Nations, the Media, Human Rights Groups, and Civil Society. Retrieved November 6, 2017."
        }
      ],
      "object_marking_refs": [
        "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
      ],
      "x_mitre_detection": "Firewalls and proxies can inspect URLs for potentially known-bad domains or parameters. They can also do reputation-based analytics on websites and their requested resources such as how old a domain is, who it's registered to, if it's on a known bad list, or how many other users have connected to it before.\n\nNetwork intrusion detection systems, sometimes with SSL/TLS MITM inspection, can be used to look for known malicious scripts (recon, heap spray, and browser identification scripts have been frequently reused), common script obfuscation, and exploit code.\n\nDetecting compromise based on the drive-by exploit from a legitimate website may be difficult. Also look for behavior on the endpoint system that might indicate successful compromise, such as abnormal behavior of browser processes. This could include suspicious files written to disk, evidence of [Process Injection](https://attack.mitre.org/techniques/T1055) for attempts to hide execution, evidence of Discovery, or other unusual network traffic that may indicate additional tools transferred to the system.",
      "x_mitre_platforms": [
        "Linux",
        "macOS",
        "SaaS",
        "Windows"
      ],
      "x_mitre_data_sources": [
        "Application Log: Application Log Content",
        "File: File Creation",
        "Network Traffic: Network Connection Creation",
        "Network Traffic: Network Traffic Content",
        "Process: Process Creation"
      ],
      "x_mitre_is_subtechnique": false,
      "x_mitre_permissions_required": [
        "User"
      ],
      "x_mitre_contributors": [
        "Jeff Sakowicz, Microsoft Identity Developer Platform Services (IDPM Services)",
        "Saisha Agrawal, Microsoft Threat Intelligent Center (MSTIC)"
      ],
      "x_mitre_version": "1.2"
    },
    {
      "type": "attack-pattern",
      "id": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add",
      "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
      "created": "2017-05-31T21:31:16.408Z",
      "modified": "2020-03-20T15:42:48.595Z",
      "name": "T1105: Ingress Tool Transfer",
      "description": "Adversaries may transfer tools or other files from an external system into a compromised environment. Files may be copied from an external adversary controlled system through the command and control channel to bring tools into the victim network or through alternate protocols with another tool such as FTP. Files can also be copied over on Mac and Linux with native tools like scp, rsync, and sftp.",
      "kill_chain_phases": [
        {
          "kill_chain_name": "lockheed",
          "phase_name": "command-and-control"
        },
        {
          "kill_chain_name": "mitre-attack",
          "phase_name": "command-and-control"
        }
      ],
      "external_references": [
        {
          "source_name": "mitre-attack",
          "url": "https://attack.mitre.org/techniques/T1105",
          "external_id": "T1105"
        },
        {
          "source_name": "University of Birmingham C2",
          "url": "https://arxiv.org/ftp/arxiv/papers/1408/1408.1136.pdf",
          "description": "Gardiner, J.,  Cova, M., Nagaraja, S. (2014, February). Command & Control Understanding, Denying and Detecting. Retrieved April 20, 2016."
        }
      ],
      "object_marking_refs": [
        "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
      ],
      "x_mitre_detection": "Monitor for file creation and files transferred into the network. Unusual processes with external network connections creating files on-system may be suspicious. Use of utilities, such as FTP, that does not normally occur may also be suspicious.\n\nAnalyze network data for uncommon data flows (e.g., a client sending significantly more data than it receives from a server). Processes utilizing the network that do not normally have network communication or have never been seen before are suspicious. Analyze packet contents to detect communications that do not follow the expected protocol behavior for the port that is being used.(Citation: University of Birmingham C2)",
      "x_mitre_platforms": [
        "Linux",
        "macOS",
        "Windows"
      ],
      "x_mitre_data_sources": [
        "File: File Creation",
        "Network Traffic: Network Connection Creation",
        "Network Traffic: Network Traffic Content",
        "Network Traffic: Network Traffic Flow"
      ],
      "x_mitre_is_subtechnique": false,
      "x_mitre_permissions_required": [
        "User"
      ],
      "x_mitre_version": "2.0"
    },
    {
      "type": "campaign",
      "id": "campaign--352e36e2-33ad-4065-a080-f13778ce9593",
      "created": "2019-05-01T15:51:07.709Z",
      "modified": "2019-10-15T15:00:35.247Z",
      "name": "Watering Hole Attack Campaign",
      "description": "The threat group compromised legitimate websites their intended visitors are likely to frequent. Over the summer of 2014, they compromised several sites, including a well-known Uyghur website written in that native language. All of the malware dropped by this watering hole attacks were Poison Ivy Remote Administration Tool (RAT).\nThe group was actively targeting: Uyghur sympathizers, East Asian office for major US-based computer manufacture, A major US university, and an international wholesale and retail telecom provider\n ",
      "first_seen": "2014-07-01T00:00:00.000Z",
      "last_seen": "2014-10-03T00:00:00.000Z"
    },
    {
      "type": "course-of-action",
      "id": "course-of-action--21ce34c9-4220-41cf-85c7-bc289bb2c79d",
      "name": "Ensure a Vulnerability Protection Profile is set to block attacks against critical and high vulnerabilities, and set to default on medium, low, and informational vulnerabilities",
      "created": "2020-06-23T19:50:31.722Z",
      "modified": "2020-06-26T19:00:11.067Z",
      "description": "Configure a Vulnerability Protection Profile set to block attacks against any critical or high vulnerabilities, at minimum, and set to default on any medium, low, or informational vulnerabilities. Configuring an alert action for low and informational, instead of default, will produce additional information at the expense of greater log utilization.",
      "x_panw_coa_bp_section_number": "6",
      "x_panw_coa_bp_recommendation_number": "6.7",
      "x_panw_coa_bp_title": "Ensure a Vulnerability Protection Profile is set to block attacks against critical and high vulnerabilities, and set to default on medium, low, and informational vulnerabilities",
      "x_panw_coa_bp_status": "published",
      "x_panw_coa_bp_scoring_status": "full",
      "x_panw_coa_bp_description": "Configure a Vulnerability Protection Profile set to block attacks against any critical or high vulnerabilities, at minimum, and set to default on any medium, low, or informational vulnerabilities. Configuring an alert action for low and informational, instead of default, will produce additional information at the expense of greater log utilization.",
      "x_panw_coa_bp_rationale_statement": "A Vulnerability Protection Profile helps to protect assets by alerting on, or blocking, network attacks. The default action for attacks against many critical and high vulnerabilities is to only alert on the attack - not to block.",
      "x_panw_coa_bp_remediation_procedure": "Navigate to `Objects > Security Profiles > Vulnerability Protection`.\n\nSet a Vulnerability Protection Profile to block attacks against any critical or high vulnerabilities (minimum), and to default on attacks against any medium, low, or informational vulnerabilities.",
      "x_panw_coa_bp_audit_procedure": "Navigate to `Objects > Security Profiles > Vulnerability Protection`.\n\nVerify a Vulnerability Protection Profile is set to block attacks against any critical or high vulnerabilities (minimum), and set to default on attacks against any medium, low, or informational vulnerabilities.",
      "x_panw_coa_bp_impact_statement": "Not configuring a Vulnerability Protection Profile means that network attacks will not be logged, alerted on or blocked.",
      "x_panw_coa_bp_cis_controls": [
        "TITLE:Deploy Network-based Anti-malware Tools CONTROL:v6 8.5 DESCRIPTION:Use network-based anti-malware tools to identify executables in all network traffic and use techniques other than signature-based detection to identify and filter out malicious content before it arrives at the endpoint.;TITLE:Deploy Network-based IPS Devices To Complement IDS Sensors CONTROL:v6 12.4 DESCRIPTION:Network-based IPS devices should be deployed to complement IDS by blocking known bad signatures or the behavior of potential attacks. As attacks become automated, methods such as IDS typically delay the amount of time it takes for someone to react to an attack. A properly configured network-based IPS can provide automation to block bad traffic. When evaluating network-based IPS products, include those using techniques other than signature-based detection (such as virtual machine or sandbox-based approaches) for consideration.;TITLE:Deploy Network-Based Intrusion Prevention Systems CONTROL:v7 12.7 DESCRIPTION:Deploy network-based Intrusion Prevention Systems (IPS) to block malicious network traffic at each of the organization's network boundaries.;TITLE:Malware Defenses CONTROL:v7 8 DESCRIPTION:Malware Defenses;TITLE:Deploy Network-based IDS Sensors on DMZ Systems CONTROL:v6 12.3 DESCRIPTION:Deploy network-based IDS sensors on Internet and extranet DMZ systems and networks that look for unusual attack mechanisms and detect compromise of these systems. These network-based IDS sensors may detect attacks through the use of signatures, network behavior analysis, or other mechanisms to analyze traffic.;"
      ],
      "x_panw_coa_bp_references": [
        "“Threat Prevention Deployment Tech Note” - https://live.paloaltonetworks.com/docs/DOC-3094:“PAN-OS Administrator's Guide 9.0 (English) - Security Profiles” - https://docs.paloaltonetworks.com/pan-os/9-0/pan-os-admin/policy/security-profiles.html"
      ]
    },
    {
      "type": "course-of-action",
      "id": "course-of-action--28f61b3c-18a6-4991-8a17-7cfcd388136c",
      "name": "Setup File Blocking",
      "created": "2020-06-23T19:50:31.722Z",
      "modified": "2020-06-26T13:02:55.803Z",
      "x_panw_coa_u42_id": "x.34",
      "x_panw_coa_u42_title": "Setup File Blocking"
    },
    {
      "type": "course-of-action",
      "id": "course-of-action--2c886776-61fb-487c-a880-41f4b7195627",
      "name": "Ensure that PAN-DB URL Filtering is used",
      "created": "2020-06-23T19:50:31.722Z",
      "modified": "2020-06-26T13:02:55.804Z",
      "description": "Configure the device to use PAN-DB URL Filtering instead of BrightCloud.",
      "x_panw_coa_bp_section_number": "6",
      "x_panw_coa_bp_recommendation_number": "6.9",
      "x_panw_coa_bp_title": "Ensure that PAN-DB URL Filtering is used",
      "x_panw_coa_bp_status": "published",
      "x_panw_coa_bp_scoring_status": "full",
      "x_panw_coa_bp_description": "Configure the device to use PAN-DB URL Filtering instead of BrightCloud.",
      "x_panw_coa_bp_rationale_statement": "Standard URL filtering provides protection against inappropriate and malicious URLs and IP addresses. PAN-DB URL Filtering is slightly less granular than the BrightCloud URL filtering. However the PAN-DB Filter offers additional malware protection and PAN threat intelligence by using the Wildfire service as an additional input, which is currently not available in the BrightCloud URL Filtering license. This makes the PAN-DB filter more responsive to specific malware 'campaigns'.",
      "x_panw_coa_bp_remediation_procedure": "Navigate to `Device > Licenses`.\n\nClick on `PAN-DB URL Filtering`.\n\nSet `Active` to `Yes`.",
      "x_panw_coa_bp_audit_procedure": "Navigate to `Device > Licenses`.\n\nClick on `PAN-DB URL Filtering`.\n\nVerify `Active` is set to `Yes`.",
      "x_panw_coa_bp_impact_statement": "Not having an effective URL Filtering configuration can leave an organization open to legal action, internal HR issues, non-compliance with regulatory policies or productivity loss.",
      "x_panw_coa_bp_cis_controls": [
        "TITLE:Deploy, Use, And Maintain Network-based URL Filters CONTROL:v6 7.6 DESCRIPTION:The organization shall maintain and enforce network based URL filters that limit a system's ability to connect to websites not approved by the organization. The organization shall subscribe to URL categorization services to ensure that they are up-to-date with the most recent website category definitions available. Uncategorized sites shall be blocked by default. This filtering shall be enforced for each of the organization's systems, whether they are physically at an organization's facilities or not.;TITLE:Maintain and Enforce Network-Based URL Filters CONTROL:v7 7.4 DESCRIPTION:Enforce network-based URL filters that limit a system's ability to connect to websites not approved by the organization. This filtering shall be enforced for each of the organization's systems, whether they are physically at an organization's facilities or not.;TITLE:Subscribe to URL-Categorization service CONTROL:v7 7.5 DESCRIPTION:Subscribe to URL categorization services to ensure that they are up-to-date with the most recent website category definitions available. Uncategorized sites shall be blocked by default.;"
      ],
      "x_panw_coa_bp_references": [
        "“PAN-OS Administrator's Guide 9.0 (English) - URL Filtering” - https://docs.paloaltonetworks.com/pan-os/9-0/pan-os-admin/url-filtering.html:“PAN-OS Administrator's Guide 9.0 (English) - URL Filtering Best Practices': https://docs.paloaltonetworks.com/pan-os/9-0/pan-os-admin/url-filtering/url-filtering-best-practices.html"
      ]
    },
    {
      "type": "course-of-action",
      "id": "course-of-action--2fd9769c-5e50-4528-985f-a1d117329991",
      "name": "Ensure that URL Filtering uses the action of “block” or “override” on the <enterprise approved value> URL categories",
      "created": "2020-06-23T19:50:31.722Z",
      "modified": "2020-06-26T13:02:55.804Z",
      "description": "Ideally, deciding which URL categories to block, and which to allow, is a joint effort between IT and another entity of authority within an organization—such as the legal department or administration. For most organizations, blocking or requiring an override on the following categories represents a minimum baseline: adult, hacking, command-and-control, copyright-infringement, extremism, malware, phishing, proxy-avoidance-and-anonymizers, and parked. Some organizations may add 'unknown' and 'dynamic-dns' to this list, at the expense of some support calls on those topics.",
      "x_panw_coa_bp_section_number": "6",
      "x_panw_coa_bp_recommendation_number": "6.10",
      "x_panw_coa_bp_title": "Ensure that URL Filtering uses the action of “block” or “override” on the <enterprise approved value> URL categories",
      "x_panw_coa_bp_status": "published",
      "x_panw_coa_bp_scoring_status": "full",
      "x_panw_coa_bp_description": "Ideally, deciding which URL categories to block, and which to allow, is a joint effort between IT and another entity of authority within an organization—such as the legal department or administration. For most organizations, blocking or requiring an override on the following categories represents a minimum baseline: adult, hacking, command-and-control, copyright-infringement, extremism, malware, phishing, proxy-avoidance-and-anonymizers, and parked. Some organizations may add 'unknown' and 'dynamic-dns' to this list, at the expense of some support calls on those topics.",
      "x_panw_coa_bp_rationale_statement": "Certain URL categories pose a technology-centric threat, such as command-and-control, copyright-infringement, extremism, malware, phishing, proxy-avoidance-and-anonymizers, and parked. Users visiting websites in these categories, many times unintentionally, are at greater risk of compromising the security of their system. Other categories, such as adult, may pose a legal liability and will be blocked for those reasons.",
      "x_panw_coa_bp_remediation_procedure": "Navigate to `Objects > Security Profiles > URL Filtering`.\n\nSet a URL filter so that all URL categories designated by the organization are listed.\nNavigate to the `Actions` tab. \nSet the action to `Block`.",
      "x_panw_coa_bp_audit_procedure": "Navigate to `Objects > Security Profiles > URL Filtering`.\n\nVerify that all URL categories designated by the organization are listed, and the action is set to `Block`.",
      "x_panw_coa_bp_impact_statement": "Not having an effective URL Filtering configuration can leave an organization open to legal action, internal HR issues, non-compliance with regulatory policies or productivity loss.",
      "x_panw_coa_bp_cis_controls": [
        "TITLE:Deploy, Use, And Maintain Network-based URL Filters CONTROL:v6 7.6 DESCRIPTION:The organization shall maintain and enforce network based URL filters that limit a system's ability to connect to websites not approved by the organization. The organization shall subscribe to URL categorization services to ensure that they are up-to-date with the most recent website category definitions available. Uncategorized sites shall be blocked by default. This filtering shall be enforced for each of the organization's systems, whether they are physically at an organization's facilities or not.;TITLE:Maintain and Enforce Network-Based URL Filters CONTROL:v7 7.4 DESCRIPTION:Enforce network-based URL filters that limit a system's ability to connect to websites not approved by the organization. This filtering shall be enforced for each of the organization's systems, whether they are physically at an organization's facilities or not.;TITLE:Subscribe to URL-Categorization service CONTROL:v7 7.5 DESCRIPTION:Subscribe to URL categorization services to ensure that they are up-to-date with the most recent website category definitions available. Uncategorized sites shall be blocked by default.;"
      ],
      "x_panw_coa_bp_references": [
        "“PAN-OS Administrator's Guide 9.0 (English) - Security Profiles” - https://docs.paloaltonetworks.com/pan-os/9-0/pan-os-admin/policy/security-profiles.html:“PAN-OS Administrator's Guide 9.0 (English) - URL Filtering” - https://docs.paloaltonetworks.com/pan-os/9-0/pan-os-admin/url-filtering.html:“PAN-OS Admin Guide 9.0 (English) - URL Filtering Best Practices': https://docs.paloaltonetworks.com/pan-os/9-0/pan-os-admin/url-filtering/url-filtering-best-practices.html"
      ]
    },
    {
      "type": "course-of-action",
      "id": "course-of-action--38519f4f-e6e8-454b-a3f5-b46daef0e316",
      "name": "Deploy XSOAR Playbook - Block IP",
      "created": "2020-06-23T19:50:31.722Z",
      "modified": "2020-06-26T13:02:55.805Z",
      "x_panw_coa_u42_id": "x.2",
      "x_panw_coa_u42_title": "Deploy XSOAR Playbook - Block IP"
    },
    {
      "type": "course-of-action",
      "id": "course-of-action--41a5e724-166d-496a-bfa6-5f7d671c733e",
      "name": "Deploy XSOAR Playbook - Hunting C&C Communication Playbook",
      "created": "2020-06-23T19:50:31.722Z",
      "modified": "2020-06-26T13:02:55.805Z",
      "x_panw_coa_u42_id": "x.22",
      "x_panw_coa_u42_title": "Deploy XSOAR Playbook - Hunting C&C Communication Playbook"
    },
    {
      "type": "course-of-action",
      "id": "course-of-action--44bfcc9e-cb15-499f-b0fe-3c41e2c2655e",
      "name": "Deploy XSOAR Playbook - Block URL",
      "created": "2020-06-23T19:50:31.722Z",
      "modified": "2020-06-26T13:02:55.805Z",
      "x_panw_coa_u42_id": "x.3",
      "x_panw_coa_u42_title": "Deploy XSOAR Playbook - Block URL"
    },
    {
      "type": "course-of-action",
      "id": "course-of-action--49790670-d365-43f8-a906-8e45c3c80f63",
      "name": "Ensure a secure Vulnerability Protection Profile is applied to all security rules allowing traffic",
      "created": "2020-06-23T19:50:31.722Z",
      "modified": "2020-06-26T19:00:11.067Z",
      "description": "For any security rule allowing traffic, apply a securely configured Vulnerability Protection Profile. Careful analysis of the target environment should be performed before implementing this configuration, as outlined by PAN’s “Threat Prevention Deployment Tech Note” in the references section.",
      "x_panw_coa_bp_section_number": "6",
      "x_panw_coa_bp_recommendation_number": "6.8",
      "x_panw_coa_bp_title": "Ensure a secure Vulnerability Protection Profile is applied to all security rules allowing traffic",
      "x_panw_coa_bp_status": "published",
      "x_panw_coa_bp_scoring_status": "full",
      "x_panw_coa_bp_description": "For any security rule allowing traffic, apply a securely configured Vulnerability Protection Profile. Careful analysis of the target environment should be performed before implementing this configuration, as outlined by PAN’s “Threat Prevention Deployment Tech Note” in the references section.",
      "x_panw_coa_bp_rationale_statement": "A Vulnerability Protection Profile helps to protect assets by alerting on, or blocking network attacks. By applying a secure Vulnerability Protection Profile to all security rules permitting traffic, all network traffic traversing the firewall will be inspected for attacks. This protects both organizational assets from attack and organizational reputation from damage.\n\nNote that encrypted sessions do not allow for complete inspection.",
      "x_panw_coa_bp_remediation_procedure": "Navigate to `Policies > Security`.\n\nFor each Policy, under the `Actions` tab, select `Vulnerability Protection`.\n\nSet it to use either the 'Strict' or the 'Default' profile, or a custom profile that complies with the organization's policies, legal and regulatory requirements.",
      "x_panw_coa_bp_audit_procedure": "Navigate to `Policies > Security`.\n\nFor each Policy, under the `Actions` tab, select `Vulnerability Protection`.\n\nVerify either the 'Strict' or the 'Default' profile is selected, or a custom profile that complies with the organization's policies, legal and regulatory requirements.",
      "x_panw_coa_bp_impact_statement": "Not configuring a Vulnerability Protection Profile means that network attacks will not be logged, alerted on or blocked.",
      "x_panw_coa_bp_cis_controls": [
        "TITLE:Deploy Network-based Anti-malware Tools CONTROL:v6 8.5 DESCRIPTION:Use network-based anti-malware tools to identify executables in all network traffic and use techniques other than signature-based detection to identify and filter out malicious content before it arrives at the endpoint.;TITLE:Deploy Network-based IDS Sensors on DMZ Systems CONTROL:v6 12.3 DESCRIPTION:Deploy network-based IDS sensors on Internet and extranet DMZ systems and networks that look for unusual attack mechanisms and detect compromise of these systems. These network-based IDS sensors may detect attacks through the use of signatures, network behavior analysis, or other mechanisms to analyze traffic.;TITLE:Deploy Network-based IDS Sensor CONTROL:v7 12.6 DESCRIPTION:Deploy network-based Intrusion Detection Systems (IDS) sensors to look for unusual attack mechanisms and detect compromise of these systems at each of the organization's network boundaries.;TITLE:Malware Defenses CONTROL:v7 8 DESCRIPTION:Malware Defenses;TITLE:Deploy Network-based IPS Devices To Complement IDS Sensors CONTROL:v6 12.4 DESCRIPTION:Network-based IPS devices should be deployed to complement IDS by blocking known bad signatures or the behavior of potential attacks. As attacks become automated, methods such as IDS typically delay the amount of time it takes for someone to react to an attack. A properly configured network-based IPS can provide automation to block bad traffic. When evaluating network-based IPS products, include those using techniques other than signature-based detection (such as virtual machine or sandbox-based approaches) for consideration.;"
      ],
      "x_panw_coa_bp_references": [
        "“Threat Prevention Deployment Tech Note” - https://live.paloaltonetworks.com/docs/DOC-3094:“PAN-OS Administrator's Guide 9.0 (English) - Security Policies” - https://docs.paloaltonetworks.com/pan-os/9-0/pan-os-admin/policy/security-policy.html:“PAN-OS Administrator's Guide 9.0 (English) - Security Profiles” - https://docs.paloaltonetworks.com/pan-os/9-0/pan-os-admin/policy/security-profiles.html"
      ]
    },
    {
      "type": "course-of-action",
      "id": "course-of-action--51bcc0dd-f051-4786-aa93-429358ea6238",
      "name": "Deploy XSOAR Playbook Cortex XDR - Isolate Endpoint",
      "created": "2020-06-23T19:50:31.722Z",
      "modified": "2020-06-26T19:00:11.067Z",
      "x_panw_coa_u42_id": "x.4",
      "x_panw_coa_u42_title": "Deploy XSOAR Playbook Cortex XDR - Isolate Endpoint"
    },
    {
      "type": "course-of-action",
      "id": "course-of-action--55e53da8-b2ba-4bba-a641-c5c75a023bb5",
      "name": "Ensure 'Security Policy' denying any/all traffic to/from IP addresses on Trusted Threat Intelligence Sources Exists",
      "created": "2020-06-23T19:50:31.722Z",
      "modified": "2020-06-26T13:02:55.805Z",
      "description": "Create a pair of security rules at the top of the security policies ruleset to block traffic to and from IP addresses known to be malicious.\n\nNote: This recommendation (as written) requires a Palo Alto 'Active Threat License'. Third Party and Open Source Threat Intelligence Feeds can also be used for this purpose.",
      "x_panw_coa_bp_section_number": "7",
      "x_panw_coa_bp_recommendation_number": "7.3",
      "x_panw_coa_bp_title": "Ensure 'Security Policy' denying any/all traffic to/from IP addresses on Trusted Threat Intelligence Sources Exists",
      "x_panw_coa_bp_status": "published",
      "x_panw_coa_bp_scoring_status": "full",
      "x_panw_coa_bp_description": "Create a pair of security rules at the top of the security policies ruleset to block traffic to and from IP addresses known to be malicious.\n\nNote: This recommendation (as written) requires a Palo Alto 'Active Threat License'. Third Party and Open Source Threat Intelligence Feeds can also be used for this purpose.",
      "x_panw_coa_bp_rationale_statement": "Creating rules that block traffic to/from known malicious sites from Trusted Threat Intelligence Sources protects you against IP addresses that Palo Alto Networks has proven to be used almost exclusively to distribute malware, initiate command-and-control activity, and launch attacks.",
      "x_panw_coa_bp_remediation_procedure": "Navigate to `Policies > Security`\n\nCreate a Security Policy similar to: \n- `General` tab: `Name` set to `Deny to Malicious IP` \n- `Source` tab: `Source Zone` set to `Any`, \n- `Destination` tab: `Destination Zone` set to `Any`, `Destination Address` set to `Palo Alto Networks - Known malicious IP addresses`\n- `Application` tab: `Application` set to `Any`\n- `Service/URL Category` tab: `Service` set to `Any`\n- `Actions` tab: `Action` set to `Block`, `Profile Type` set to `None`\n\nCreate a Security Policy similar to with: \n- `General` tab: `Name` set to `Deny from Malicious IP` \n- `Source` tab: `Source Zone` set to `Any`, `Source Address` set to `Palo Alto Networks - Known malicious IP addresses`\n- `Destination` tab: `Destination Zone` set to `Any`\n- `Application` tab: `Application` set to `Any`\n- `Service/URL Category` tab: `Service` set to `Any`\n- `Actions` tab: `Action` set to `Block`, `Profile Type` set to `None`\n\nNote: This recommendation requires a Palo Alto 'Active Threat License'",
      "x_panw_coa_bp_audit_procedure": "Navigate to `Policies > Security`\n\nVerify a Security Policy exists similar to: \n- `General` tab: `Name` set to `Deny to Malicious IP` \n- `Source` tab: `Source Zone` set to `Any`, \n- `Destination` tab: `Destination Zone` set to `Any`, `Destination Address` set to `Palo Alto Networks - Known malicious IP addresses`\n- `Application` tab: `Application` set to `Any`\n- `Service/URL Category` tab: `Service` set to `Any`\n- `Actions` tab: `Action` set to `Block`, `Profile Type` set to `None`\n\nVerify a Security Policy exists with: \n- `General` tab: `Name` set to `Deny from Malicious IP` \n- `Source` tab: `Source Zone` set to `Any`, `Source Address` set to `Palo Alto Networks - Known malicious IP addresses`\n- `Destination` tab: `Destination Zone` set to `Any`\n- `Application` tab: `Application` set to `Any`\n- `Service/URL Category` tab: `Service` set to `Any`\n- `Actions` tab: `Action` set to `Block`, `Profile Type` set to `None`\n\nNote: This recommendation requires a Palo Alto 'Active Threat License'",
      "x_panw_coa_bp_impact_statement": "While not foolproof, simply blocking traffic from known malicious hosts allows more resources to be devoted to analyzing traffic from other sources for malicious content. This approach is a recommended part of most 'Defense in Depth' recommendations, allowing defenders to focus more deeply on traffic from uncategorized sources.",
      "x_panw_coa_bp_cis_controls": [
        "TITLE:Email and Web Browser Protections CONTROL:v7 7 DESCRIPTION:Email and Web Browser Protections;TITLE:Malware Defenses CONTROL:v7 8 DESCRIPTION:Malware Defenses;TITLE:Boundary Defense CONTROL:v7 12 DESCRIPTION:Boundary Defense;TITLE:Deny Communications with Known Malicious IP Addresses CONTROL:v7 12.3 DESCRIPTION:Deny communications with known malicious or unused Internet IP addresses and limit access only to trusted and necessary IP address ranges at each of the organization's network boundaries,.;"
      ],
      "x_panw_coa_bp_references": [
        "PAN-OS 9.0 Admin Guide: Built-in External Dynamic Lists': https://docs.paloaltonetworks.com/pan-os/9-0/pan-os-admin/policy/use-an-external-dynamic-list-in-policy/built-in-edls.html#:'PAN-OS 9.0 Admin Guide: Create Rules Based on Trusted Threat Intelligence Sources': https://docs.paloaltonetworks.com/best-practices/9-0/internet-gateway-best-practices/best-practice-internet-gateway-security-policy/define-the-initial-internet-gateway-security-policy/step-1-create-rules-based-on-trusted-threat-intelligence-sources.html#"
      ]
    },
    {
      "type": "course-of-action",
      "id": "course-of-action--5839cd6c-7897-43c4-82f3-5c03096a51c4",
      "name": "Ensure passive DNS monitoring is set to enabled on all anti-spyware profiles in use",
      "created": "2020-06-23T19:50:31.722Z",
      "modified": "2020-06-26T13:02:55.804Z",
      "description": "Enable passive DNS monitoring within all anti-spyware profiles in use.",
      "x_panw_coa_bp_section_number": "6",
      "x_panw_coa_bp_recommendation_number": "6.5",
      "x_panw_coa_bp_title": "Ensure passive DNS monitoring is set to enabled on all anti-spyware profiles in use",
      "x_panw_coa_bp_status": "published",
      "x_panw_coa_bp_scoring_status": "full",
      "x_panw_coa_bp_description": "Enable passive DNS monitoring within all anti-spyware profiles in use.",
      "x_panw_coa_bp_rationale_statement": "Enabling passive DNS monitoring improves PAN’s threat prevention and threat intelligence capabilities. This is performed without source information delivered to PAN to ensure sensitive DNS information of the organization is not compromised.",
      "x_panw_coa_bp_remediation_procedure": "Navigate to `Device > Setup > Telemetry`. Set `Passive DNS Monitoring` to enabled",
      "x_panw_coa_bp_audit_procedure": "Navigate to `Device > Setup > Telemetry`. Ensure that `Passive DNS Monitoring` is enabled",
      "x_panw_coa_bp_cis_controls": [
        "TITLE:Enabled DNS Query Logging CONTROL:v6 8.6 DESCRIPTION:Enable domain name system (DNS) query logging to detect hostname lookup for known malicious C2 domains.;TITLE:Deploy Network-based Anti-malware Tools CONTROL:v6 8.5 DESCRIPTION:Use network-based anti-malware tools to identify executables in all network traffic and use techniques other than signature-based detection to identify and filter out malicious content before it arrives at the endpoint.;TITLE:Enable DNS Query Logging CONTROL:v7 8.7 DESCRIPTION:Enable Domain Name System (DNS) query logging to detect hostname lookups for known malicious domains.;TITLE:Malware Defenses CONTROL:v7 8 DESCRIPTION:Malware Defenses;"
      ],
      "x_panw_coa_bp_references": [
        "“What Information is Submitted to the Palo Alto Networks when Enabling the Passive DNS Feature” - https://live.paloaltonetworks.com/docs/DOC-7256:'PAN-OS Administrator's Guide 9.0 (English) - DNS Security' - https://docs.paloaltonetworks.com/pan-os/9-0/pan-os-admin/threat-prevention/dns-security.html#"
      ]
    },
    {
      "type": "course-of-action",
      "id": "course-of-action--5e951942-0565-46f4-b09e-80426812b6b5",
      "name": "Ensure that access to every URL is logged",
      "created": "2020-06-23T19:50:31.722Z",
      "modified": "2020-06-26T13:02:55.804Z",
      "description": "URL filters should not specify any categories as `Allow Categories`.",
      "x_panw_coa_bp_section_number": "6",
      "x_panw_coa_bp_recommendation_number": "6.11",
      "x_panw_coa_bp_title": "Ensure that access to every URL is logged",
      "x_panw_coa_bp_status": "published",
      "x_panw_coa_bp_scoring_status": "full",
      "x_panw_coa_bp_description": "URL filters should not specify any categories as `Allow Categories`.",
      "x_panw_coa_bp_rationale_statement": "Setting a URL filter to have one or more entries under Allow Categories will cause no log entries to be produced in the URL Filtering logs for access to URLs in those categories. For forensic, legal, and HR purposes, it is advisable to log access to every URL. In many cases failure to log all URL access is a violation of corporate policy, legal requirements or regulatory requirements.",
      "x_panw_coa_bp_remediation_procedure": "Navigate to `Objects > Security Profiles > URL Filtering`.\n\nFor each permitted category, set the `Site Access` actioun to `alert`",
      "x_panw_coa_bp_audit_procedure": "Navigate to `Objects > Security Profiles > URL Filtering`.\n\nVerify that the for all allowed categories, that the `Site Access` action is set to `alert`",
      "x_panw_coa_bp_impact_statement": "Not having an effective URL Filtering configuration can leave an organization open to legal action, internal HR issues, non-compliance with regulatory policies or productivity loss.",
      "x_panw_coa_bp_cis_controls": [
        "TITLE:Log All URL Requests From Systems CONTROL:v6 7.4 DESCRIPTION:Log all URL requests from each of the organization's systems, whether onsite or a mobile device, in order to identify potentially malicious activity and assist incident handlers with identifying potentially compromised systems.;TITLE:Log all URL requests CONTROL:v7 7.6 DESCRIPTION:Log all URL requests from each of the organization's systems, whether onsite or a mobile device, in order to identify potentially malicious activity and assist incident handlers with identifying potentially compromised systems.;TITLE:Ensure Network Boundary Devices Log Verbosely CONTROL:v6 6.5 DESCRIPTION:Configure network boundary devices, including firewalls, network-based IPS, and inbound and outbound proxies, to verbosely log all traffic (both allowed and blocked) arriving at the device.;TITLE:Activate audit logging CONTROL:v7 6.2 DESCRIPTION:Ensure that local logging has been enabled on all systems and networking devices.;TITLE:Enable Detailed Logging CONTROL:v7 6.3 DESCRIPTION:Enable system logging to include detailed information such as an event source, date, user, timestamp, source addresses, destination addresses, and other useful elements.;"
      ],
      "x_panw_coa_bp_references": [
        "“PAN-OS Administrator's Guide 9.0 (English) - URL Filtering Best Practices': https://docs.paloaltonetworks.com/pan-os/9-0/pan-os-admin/url-filtering/url-filtering-best-practices.html:“PAN-OS Administrator's Guide 9.0 (English) - URL Filtering” - https://docs.paloaltonetworks.com/pan-os/9-0/pan-os-admin/url-filtering.html"
      ]
    },
    {
      "type": "course-of-action",
      "id": "course-of-action--60e78a97-dcc6-4d67-a310-ed7f16e0218a",
      "name": "XDR BIOCs / ABIOCs",
      "created": "2020-06-23T19:50:31.722Z",
      "modified": "2020-06-26T19:00:11.068Z",
      "x_panw_coa_u42_id": "x.29",
      "x_panw_coa_u42_title": "XDR BIOCs / ABIOCs"
    },
    {
      "type": "course-of-action",
      "id": "course-of-action--645c6c45-116e-4265-98d2-e30f56325bc6",
      "name": "Ensure that antivirus profiles are set to block on all decoders except 'imap' and 'pop3'",
      "created": "2020-06-23T19:50:31.722Z",
      "modified": "2020-06-26T13:02:55.803Z",
      "description": "Configure antivirus profiles to a value of 'block' for all decoders except imap and pop3 under both Action and WildFire Action. If required by the organization's email implementation, configure imap and pop3 decoders to 'alert' under both Action and WildFire Action.",
      "x_panw_coa_bp_section_number": "6",
      "x_panw_coa_bp_recommendation_number": "6.1",
      "x_panw_coa_bp_title": "Ensure that antivirus profiles are set to block on all decoders except 'imap' and 'pop3'",
      "x_panw_coa_bp_status": "published",
      "x_panw_coa_bp_scoring_status": "full",
      "x_panw_coa_bp_description": "Configure antivirus profiles to a value of 'block' for all decoders except imap and pop3 under both Action and WildFire Action. If required by the organization's email implementation, configure imap and pop3 decoders to 'alert' under both Action and WildFire Action.",
      "x_panw_coa_bp_rationale_statement": "Antivirus signatures produce low false positives. By blocking any detected malware through the specified decoders, the threat of malware propagation through the firewall is greatly reduced. It is recommended to mitigate malware found in pop3 and imap through a dedicated antivirus gateway. Due to the nature of the pop3 and imap protocols, the firewall is not able to block only a single email message containing malware. Instead, the entire session would be terminated, potentially affecting benign email messages.",
      "x_panw_coa_bp_remediation_procedure": "Navigate to `Objects > Security Profiles > Antivirus.`\n\nSet antivirus profiles to have all decoders set to `block` for both `Action` and `Wildfire Action`. If `imap` and `pop3` are required in the organization, set the `imap` and `pop3` decoders to `alert` for both `Action` and `Wildfire Action`.",
      "x_panw_coa_bp_audit_procedure": "Navigate to `Objects > Security Profiles > Antivirus`\n\nVerify that antivirus profiles have all decoders set to `block` for both `Action` and `Wildfire Action`. If `imap` and `pop3` are required in the organization, verify that the `imap` and `pop3` decoders are set to `alert` for both `Action` and `Wildfire Action`.",
      "x_panw_coa_bp_cis_controls": [
        "TITLE:Deploy Network-based Anti-malware Tools CONTROL:v6 8.5 DESCRIPTION:Use network-based anti-malware tools to identify executables in all network traffic and use techniques other than signature-based detection to identify and filter out malicious content before it arrives at the endpoint.;TITLE:Malware Defenses CONTROL:v7 8 DESCRIPTION:Malware Defenses;"
      ],
      "x_panw_coa_bp_references": [
        "“Threat Prevention Deployment Tech Note” - https://live.paloaltonetworks.com/docs/DOC-3094:“PAN-OS Administrator's Guide 9.0 (English) - Security Profiles” - https://docs.paloaltonetworks.com/pan-os/9-0/pan-os-admin/policy/security-profiles.html"
      ]
    },
    {
      "type": "course-of-action",
      "id": "course-of-action--79fd0d10-6272-4191-8b8d-9c72f19358d0",
      "name": "Ensure that WildFire file size upload limits are maximized",
      "created": "2020-06-23T19:50:31.722Z",
      "modified": "2020-06-26T13:02:55.803Z",
      "description": "Increase WildFire file size limits to the maximum file size supported by the environment. An organization with bandwidth constraints or heavy usage of unique files under a supported file type may require lower settings.\nThe recommendations account for the CPU load on smaller platforms. If an organization consistently has CPU to spare, it's recommended to set some or all of these values to the maximum.",
      "x_panw_coa_bp_section_number": "5",
      "x_panw_coa_bp_recommendation_number": "5.1",
      "x_panw_coa_bp_title": "Ensure that WildFire file size upload limits are maximized",
      "x_panw_coa_bp_status": "published",
      "x_panw_coa_bp_scoring_status": "full",
      "x_panw_coa_bp_description": "Increase WildFire file size limits to the maximum file size supported by the environment. An organization with bandwidth constraints or heavy usage of unique files under a supported file type may require lower settings.\nThe recommendations account for the CPU load on smaller platforms. If an organization consistently has CPU to spare, it's recommended to set some or all of these values to the maximum.",
      "x_panw_coa_bp_rationale_statement": "Increasing file size limits allows the devices to forward more files for WildFire analysis. This increases the chances of identifying, and later preventing, threats in larger files. The default values are configured for files small enough that the majority of files are not assessed by Wildfire.",
      "x_panw_coa_bp_remediation_procedure": "Navigate to `Device > Setup > WildFire`.\n\nClick the `General Settings` edit icon.\n\nSet the maximum size for each file type are larger than the defaults, to a size that is as large enough to account for 'large' files, but not large enough to affect performance of the hardware. \n\nIn PAN-OS 9.x, the default file sizes for WildFire are: \n\n- pe (Portable Executable) - 16MB\n- apk (Android Application)- 10MB\n- pdf (Portable Document Format) - 3072KB\n- ms-office (Microsoft Office) — 16384KB\n- jar (Packaged Java class file) — 5MB\n- flash (Adobe Flash) — 5MB\n- MacOSX (DMG/MAC-APP/MACH-O PKG files) — 10MB\n- archive (RAR and 7z files) — 50MB\n- linux (ELF files) — 50MB\n- script (JScript, VBScript, PowerShell, and Shell Script)- 20KB\n\nIn PAN-OS 9.x, the maximum file sizes for Wildfire are:\n- pe (Portable Executable) - 50MB\n- apk (Android Application)- 50MB\n- pdf (Portable Document Format) - 51200KB\n- ms-office (Microsoft Office) — 51200KB\n- jar (Packaged Java class file) — 20MB\n- flash (Adobe Flash) — 10MB\n- MacOSX (DMG/MAC-APP/MACH-O PKG files) — 50MB\n- archive (RAR and 7z files) — 50MB\n- linux (ELF files) — 50MB\n- script (JScript, VBScript, PowerShell, and Shell Script)- 4096KB",
      "x_panw_coa_bp_audit_procedure": "Navigate to `Device > Setup > WildFire`.\n\nNavigate to the `General Settings` sections.\n\nVerify the maximum size for each file type are larger than the defaults, to a size that is as large enough to account for 'large' files, but not large enough to affect performance of the hardware.",
      "x_panw_coa_bp_impact_statement": "With the default values known, an attacker has only to send an infected file slightly over the 'maximum' size for that filetype to evade detection at the perimeter. Many of the values are significantly lower than is typical for each file size.",
      "x_panw_coa_bp_cis_controls": [
        "TITLE:Deploy Network-based Anti-malware Tools CONTROL:v6 8.5 DESCRIPTION:Use network-based anti-malware tools to identify executables in all network traffic and use techniques other than signature-based detection to identify and filter out malicious content before it arrives at the endpoint.;TITLE:Malware Defenses CONTROL:v7 8 DESCRIPTION:Malware Defenses;"
      ],
      "x_panw_coa_bp_references": [
        "“Wildfire Administrator's Guide 9.0 (English) - Increased Wildfire File Forwarding Capacity' - https://docs.paloaltonetworks.com/wildfire/u-v/wildfire-whats-new/wildfire-features-in-panos-90/increased-wildfire-file-forwarding-capacity:“How to Configure WildFire” - https://live.paloaltonetworks.com/docs/DOC-3252:“Wildfire Administrator's Guide 9.0 (English) - Wildfire Best Practices' - https://docs.paloaltonetworks.com/wildfire/9-0/wildfire-admin/wildfire-deployment-best-practices/wildfire-best-practices.html#:“Wildfire Administrator's Guide 9.0 (English) - Forward Files for Wildfire Analysis' - https://docs.paloaltonetworks.com/wildfire/9-0/wildfire-admin/submit-files-for-wildfire-analysis/forward-files-for-wildfire-analysis.html#"
      ]
    },
    {
      "type": "course-of-action",
      "id": "course-of-action--8190ac5a-8a5e-41bc-85dd-62e0f5cdd2ba",
      "name": "Ensure a WildFire Analysis profile is enabled for all security policies",
      "created": "2020-06-23T19:50:31.722Z",
      "modified": "2020-06-26T13:02:55.804Z",
      "description": "Ensure that all files traversing the firewall are inspected by WildFire by setting a Wildfire file blocking profile on all security policies.",
      "x_panw_coa_bp_section_number": "5",
      "x_panw_coa_bp_recommendation_number": "5.3",
      "x_panw_coa_bp_title": "Ensure a WildFire Analysis profile is enabled for all security policies",
      "x_panw_coa_bp_status": "published",
      "x_panw_coa_bp_scoring_status": "full",
      "x_panw_coa_bp_description": "Ensure that all files traversing the firewall are inspected by WildFire by setting a Wildfire file blocking profile on all security policies.",
      "x_panw_coa_bp_rationale_statement": "Traffic matching security policies that do not include a WildFire file blocking profile will not utilize WildFire for file analysis. Wildfire analysis is one of the key security measures available on this platform. Without Wildfire analysis enabled, inbound malware can only be analyzed by signature - which industry wide is roughly 40-60% effective. In a targeted attack, the success of signature-based-only analysis drops even further.",
      "x_panw_coa_bp_remediation_procedure": "To Set File Blocking Profile:\n\n- Navigate to `Objects > Security Profiles > WildFire Analysis Profile`.\n- Create a WildFire profile that has 'Application Any', 'File Types Any', and 'Direction Both' \n\nTo Set WildFire Analysis Rules: \n\n- Navigate to `Policies > Security`.\n- For each Security Policy Rule where the action is 'Allow', Navigate to `Actions > Profile Setting > WildFire Analysis` and set a WildFire Analysis profile.\n\n**Group Profiles** can also be used. To take this approach:\n- Navigate to `Objects > Security Profile Groups`. Create a Security Profile Group, and ensure that (among other settings) the `Wildfire Analysis Profile` is set to the created profile.\n- Navigate to `Policies > Security`. For each Security Policy Rule where the action is 'Allow', Navigate to `Actions > Profile Setting`. Modify the `Profile Type` to `Group`, and set the `Group Profile` to the created Security Profile Group.",
      "x_panw_coa_bp_audit_procedure": "To verify WildFire Analysis Profile:\n\n- Navigate to `Objects > Security Profiles > WildFire Analysis Profile` verify that a profile exists. \n\nTo verify File Blocking Rules:\n\n- For each Security Policy were the action is set to Allow, edit the Rule and navigate to `Actions > Profile Setting. Ensure that the WildFire Analysis` is set to `Allow` and verify that a profile is set.\n\nIf **Group Profiles** are used:\n- Navigate to `Policies > Security`\n- For each Security Policy were the action is set to Allow, edit the Rule and navigate to `Actions > Profile Setting`. Ensure that the `Profile Type` is set to `Group`.\n- Navigate to Objects > Security Profile Groups. Open the Security Profile Group used above, and ensure that the Wildfire Analysis Profile is set.",
      "x_panw_coa_bp_cis_controls": [
        "TITLE:Deploy Network-based Anti-malware Tools CONTROL:v6 8.5 DESCRIPTION:Use network-based anti-malware tools to identify executables in all network traffic and use techniques other than signature-based detection to identify and filter out malicious content before it arrives at the endpoint.;TITLE:Malware Defenses CONTROL:v7 8 DESCRIPTION:Malware Defenses;"
      ],
      "x_panw_coa_bp_references": [
        "“Wildfire Administrator's Guide 9.0 (English)' - https://docs.paloaltonetworks.com/wildfire/9-0/wildfire-admin.html"
      ]
    },
    {
      "type": "course-of-action",
      "id": "course-of-action--922b1227-c493-43f6-8b4a-ae6d6963eb8b",
      "name": "Ensure 'SSL Inbound Inspection' is required for all untrusted traffic destined for servers using SSL or TLS",
      "created": "2020-06-23T19:50:31.722Z",
      "modified": "2020-06-26T19:00:11.067Z",
      "description": "Configure SSL Inbound Inspection for all untrusted traffic destined for servers using SSL or TLS.",
      "x_panw_coa_bp_section_number": "8",
      "x_panw_coa_bp_recommendation_number": "8.2",
      "x_panw_coa_bp_title": "Ensure 'SSL Inbound Inspection' is required for all untrusted traffic destined for servers using SSL or TLS",
      "x_panw_coa_bp_status": "published",
      "x_panw_coa_bp_scoring_status": "full",
      "x_panw_coa_bp_description": "Configure SSL Inbound Inspection for all untrusted traffic destined for servers using SSL or TLS.",
      "x_panw_coa_bp_rationale_statement": "Without SSL Inbound Inspection, the firewall is not able to protect SSL or TLS-enabled webservers against many threats.",
      "x_panw_coa_bp_remediation_procedure": "Navigate to `Policies > Decryption`.\n\nSet `SSL Inbound Inspection` appropriately for all untrusted traffic destined for servers using SSL or TLS.\n\nNavigate to `Policies > Decryption`. For each service published to the internet (or other untrusted zones), create a Policy and set the following options:\n- `General` tab: `Name` set to a descriptive name\n- `Source`: `Source Zone` set to the target zone (Internet in many cases). `Source Address` set to the target address space (`Any` for internet traffic)\n- `Destination` tab: `Destination Zone` should be set to the appropriate zone, or `Any`. `Destination Address` set to the target host address\n- `Options` tab: Type set to `SSL Inbound Inspection`",
      "x_panw_coa_bp_audit_procedure": "Navigate to `Policies > Decryption`.\n\nVerify `SSL Inbound Inspection` is set appropriately for all untrusted traffic destined for servers using SSL or TLS.\n\nNavigate to `Policies > Decryption`. For each service published to the internet (or other untrusted zones), verify the following settings:\n- `General` tab: `Name` set to a descriptive name\n- `Source`: `Source Zone` set to the target zone (Internet in many cases). `Source Address` set to the target address space (`Any` for internet traffic)\n- `Destination` tab: `Destination Zone` should be set to the appropriate zone, or `Any`. `Destination Address` set to the target host address\n- `Options` tab: Type set to `SSL Inbound Inspection`",
      "x_panw_coa_bp_impact_statement": "Not decrypting inbound traffic to TLS encrypted services means that inspection for many common attacks cannot occur on the firewall. This means that all defenses against these attacks are up to the host.",
      "x_panw_coa_bp_cis_controls": [
        "TITLE:Design Network Perimeters To Leverage Proxy CONTROL:v6 12.5 DESCRIPTION:Design and implement network perimeters so that all outgoing network traffic to the Internet must pass through at least one application layer filtering proxy server. The proxy should support decrypting network traffic, logging individual TCP sessions, blocking specific URLs, domain names, and IP addresses to implement a black list, and applying whitelists of allowed sites that can be accessed through the proxy while blocking all other sites. Organizations should force outbound traffic to the Internet through an authenticated proxy server on the enterprise perimeter.;TITLE:Boundary Defense CONTROL:v6 12 DESCRIPTION:Boundary Defense;TITLE:Deploy Application Layer Filtering Proxy Server CONTROL:v7 12.9 DESCRIPTION:Ensure that all network traffic to or from the Internet passes through an authenticated application layer proxy that is configured to filter unauthorized connections.;TITLE:Decrypt Network Traffic at Proxy CONTROL:v7 12.10 DESCRIPTION:Decrypt all encrypted network traffic at the boundary proxy prior to analyzing the content. However, the organization may use whitelists of allowed sites that can be accessed through the proxy without decrypting the traffic.;TITLE:Boundary Defense CONTROL:v7 12 DESCRIPTION:Boundary Defense;"
      ],
      "x_panw_coa_bp_references": [
        "“How to Implement SSL Decryption” - https://live.paloaltonetworks.com/docs/DOC- 1412:“PAN-OS Administrator's Guide 9.0 (English) - Decryption (English)” - https://docs.paloaltonetworks.com/pan-os/9-0/pan-os-admin/decryption.html#"
      ]
    },
    {
      "type": "course-of-action",
      "id": "course-of-action--9bcdca50-296d-4032-8639-dc8bc56077a3",
      "name": "Ensure 'Service setting of ANY' in a security policy allowing traffic does not exist",
      "created": "2020-06-23T19:50:31.722Z",
      "modified": "2020-06-26T13:02:55.805Z",
      "description": "Create security policies specifying application-default for the Service setting, in addition to the specific ports desired. The Service setting of `any` should not be used for any policies that allow traffic.",
      "x_panw_coa_bp_section_number": "7",
      "x_panw_coa_bp_recommendation_number": "7.2",
      "x_panw_coa_bp_title": "Ensure 'Service setting of ANY' in a security policy allowing traffic does not exist",
      "x_panw_coa_bp_status": "published",
      "x_panw_coa_bp_scoring_status": "full",
      "x_panw_coa_bp_description": "Create security policies specifying application-default for the Service setting, in addition to the specific ports desired. The Service setting of `any` should not be used for any policies that allow traffic.",
      "x_panw_coa_bp_rationale_statement": "App-ID requires a number of packets to traverse the firewall before an application can be identified and either allowed or dropped. Due to this behavior, even when an application is defined in a security policy, a service setting of `any` may allow a device in one zone to perform ports scans on IP addresses in a different zone. In addition, this recommendation helps to avoid an App-ID cache pollution attack.\n\nBecause of how App-ID works, configuring the service setting to 'Any' allows some initial traffic to reach the target host before App-ID can recognize and appropriately restrict the traffic. Setting the Service Setting to application specific at least restricts the traffic to the target applications or protocols for that initial volume of traffic.",
      "x_panw_coa_bp_remediation_procedure": "Navigate to `Policies > Security`. \n\nFor each exposed host, set a Security Policy exists with:\n\n- `Source` tab: `Zone` set to `OUTSIDE` `Address` set to `any`\n- `Destination` tab: `Zone` set to `DMZ` / `Address` set to `` \n- `Application` tab: `Application` set to `web-browsing` (or appropriate application)\n- `Service` tab: `Service` set to `application-default`. The value of `any` should never be used",
      "x_panw_coa_bp_audit_procedure": "Navigate to `Policies > Security`. \n\nFor each exposed host, verify that a Security Policy exists with:\n\n- `Source` tab: `Zone` set to `OUTSIDE` `Address` set to `any`\n- `Destination` tab: `Zone` set to `DMZ` / `Address` set to `` \n- `Application` tab: `Application` set to `web-browsing` (or appropriate application)\n- `Service` tab: `Service` set to `application-default`. The value of `any` should never be used",
      "x_panw_coa_bp_cis_controls": [
        "TITLE:Limit Open Ports, Protocols, and Services CONTROL:v6 9.1 DESCRIPTION:Ensure that only ports, protocols, and services with validated business needs are running on each system.;TITLE:Ensure Only Approved Ports, Protocols and Services Are Running CONTROL:v7 9.2 DESCRIPTION:Ensure that only network ports, protocols, and services listening on a system with validated business needs, are running on each system.;"
      ],
      "x_panw_coa_bp_references": [
        "“Security Policy Guidelines” - https://live.paloaltonetworks.com/docs/DOC-3469:“Security Bulletin: App-ID Cache Pollution” - http://researchcenter.paloaltonetworks.com/2012/12/app-id-cache-pollution-response/:“PAN-OS Administrator's Guide 9.0 (English) - Security Policiy Overview ” - https://docs.paloaltonetworks.com/pan-os/9-0/pan-os-web-interface-help/policies/policies-security/security-policy-overview.html#"
      ]
    },
    {
      "type": "course-of-action",
      "id": "course-of-action--a1294d38-0f0d-4973-a949-f38cccbc7469",
      "name": "Ensure an anti-spyware profile is configured to block on all spyware severity levels, categories, and threats",
      "created": "2020-06-23T19:50:31.722Z",
      "modified": "2020-06-26T13:02:55.804Z",
      "description": "If a single rule exists within the anti-spyware profile, configure it to block on any spyware severity level, any category, and any threat. If multiple rules exist within the anti-spyware profile, ensure all spyware categories, threats, and severity levels are set to be blocked. Additional rules may exist for packet capture or exclusion purposes.",
      "x_panw_coa_bp_section_number": "6",
      "x_panw_coa_bp_recommendation_number": "6.3",
      "x_panw_coa_bp_title": "Ensure an anti-spyware profile is configured to block on all spyware severity levels, categories, and threats",
      "x_panw_coa_bp_status": "published",
      "x_panw_coa_bp_scoring_status": "full",
      "x_panw_coa_bp_description": "If a single rule exists within the anti-spyware profile, configure it to block on any spyware severity level, any category, and any threat. If multiple rules exist within the anti-spyware profile, ensure all spyware categories, threats, and severity levels are set to be blocked. Additional rules may exist for packet capture or exclusion purposes.",
      "x_panw_coa_bp_rationale_statement": "Requiring a blocking policy for all spyware threats, categories, and severities reduces the risk of spyware traffic from successfully exiting the organization. Without an anti-spyware profile assigned to any potential hostile zone, the first protection in the path against malware is removed, leaving in most cases only the desktop endpoint protection application to detect and remediate any potential spyware.",
      "x_panw_coa_bp_remediation_procedure": "Navigate to `Objects > Security Profiles > Anti-Spyware`.\n\nSet a rule within the anti-spyware profile that is configured to perform the `Block Action` on `any Severity` level, `any Category`, and `any Threat Name`.",
      "x_panw_coa_bp_audit_procedure": "Navigate to `Objects > Security Profiles > Anti-Spyware`.\n\nVerify a rule exists within the anti-spyware profile that is configured to perform the `Block Action` on `any Severity` level, `any Category`, and `any Threat Name`.",
      "x_panw_coa_bp_cis_controls": [
        "TITLE:Deploy Network-based Anti-malware Tools CONTROL:v6 8.5 DESCRIPTION:Use network-based anti-malware tools to identify executables in all network traffic and use techniques other than signature-based detection to identify and filter out malicious content before it arrives at the endpoint.;TITLE:Malware Defenses CONTROL:v7 8 DESCRIPTION:Malware Defenses;"
      ],
      "x_panw_coa_bp_references": [
        "“PAN-OS Administrator's Guide 9.0 (English) - Security Profiles': https://docs.paloaltonetworks.com/pan-os/9-0/pan-os-admin/policy/security-policy.html"
      ]
    },
    {
      "type": "course-of-action",
      "id": "course-of-action--a592acb0-98ba-4a8e-a5cf-2e78d2806e75",
      "name": "Ensure all WildFire session information settings are enabled",
      "created": "2020-06-23T19:50:31.722Z",
      "modified": "2020-06-26T13:02:55.804Z",
      "description": "Enable all options under Session Information Settings for WildFire.",
      "x_panw_coa_bp_section_number": "5",
      "x_panw_coa_bp_recommendation_number": "5.5",
      "x_panw_coa_bp_title": "Ensure all WildFire session information settings are enabled",
      "x_panw_coa_bp_status": "published",
      "x_panw_coa_bp_scoring_status": "full",
      "x_panw_coa_bp_description": "Enable all options under Session Information Settings for WildFire.",
      "x_panw_coa_bp_rationale_statement": "Permitting the firewall to send all of this information to WildFire creates more detailed reports, thereby making the process of tracking down potentially infected devices more efficient. This could prevent an infected system from further infecting the environment. Environments with security policies restricting sending this data to the WildFire cloud can instead utilize an on-premises WildFire appliance. In addition, risk can be analyzed in the context of the destination host and user account, either during analysis or during incident response.",
      "x_panw_coa_bp_remediation_procedure": "Navigate to `Device > Setup > WildFire > Session Information Settings`.\n\nSet every option to be enabled.",
      "x_panw_coa_bp_audit_procedure": "Navigate to `Device > Setup > WildFire > Session Information Settings`.\n\nVerify that every option is enabled.",
      "x_panw_coa_bp_cis_controls": [
        "TITLE:Deploy Network-based Anti-malware Tools CONTROL:v6 8.5 DESCRIPTION:Use network-based anti-malware tools to identify executables in all network traffic and use techniques other than signature-based detection to identify and filter out malicious content before it arrives at the endpoint.;TITLE:Ensure Network Boundary Devices Log Verbosely CONTROL:v6 6.5 DESCRIPTION:Configure network boundary devices, including firewalls, network-based IPS, and inbound and outbound proxies, to verbosely log all traffic (both allowed and blocked) arriving at the device.;TITLE:Activate audit logging CONTROL:v7 6.2 DESCRIPTION:Ensure that local logging has been enabled on all systems and networking devices.;TITLE:Malware Defenses CONTROL:v7 8 DESCRIPTION:Malware Defenses;TITLE:Malware Defenses CONTROL:v6 8 DESCRIPTION:Malware Defenses;TITLE:Centralize Anti-malware Logging CONTROL:v7 8.6 DESCRIPTION:Send all malware detection events to enterprise anti-malware administration tools and event log servers for analysis and alerting.;"
      ],
      "x_panw_coa_bp_references": [
        "“Wildfire Administrator's Guide 9.0 (English)' - https://docs.paloaltonetworks.com/wildfire/9-0/wildfire-admin.html#:“Wildfire Administrator's Guide 9.0 (English) - Wildfire Best Practices' - /https://docs.paloaltonetworks.com/wildfire/9-0/wildfire-admin/wildfire-deployment-best-practices/wildfire-best-practices.html"
      ]
    },
    {
      "type": "course-of-action",
      "id": "course-of-action--a79d2365-61c7-48b9-b024-e2020b99bba0",
      "name": "Ensure alerts are enabled for malicious files detected  by WildFire",
      "created": "2020-06-23T19:50:31.722Z",
      "modified": "2020-06-26T13:02:55.804Z",
      "description": "Configure WildFire to send an alert when a malicious or greyware file is detected. This alert could be sent by whichever means is preferable, including email, SNMP trap, or syslog message.\n\nAlternatively, configure the WildFire cloud to generate alerts for malicious files. The cloud can generate alerts in addition to or instead of the local WildFire implementation. Note that the destination email address of alerts configured in the WildFire cloud portal is tied to the logged in account, and cannot be modified. Also, new systems added to the WildFire cloud portal will not be automatically set to email alerts.",
      "x_panw_coa_bp_section_number": "5",
      "x_panw_coa_bp_recommendation_number": "5.6",
      "x_panw_coa_bp_title": "Ensure alerts are enabled for malicious files detected  by WildFire",
      "x_panw_coa_bp_status": "published",
      "x_panw_coa_bp_scoring_status": "full",
      "x_panw_coa_bp_description": "Configure WildFire to send an alert when a malicious or greyware file is detected. This alert could be sent by whichever means is preferable, including email, SNMP trap, or syslog message.\n\nAlternatively, configure the WildFire cloud to generate alerts for malicious files. The cloud can generate alerts in addition to or instead of the local WildFire implementation. Note that the destination email address of alerts configured in the WildFire cloud portal is tied to the logged in account, and cannot be modified. Also, new systems added to the WildFire cloud portal will not be automatically set to email alerts.",
      "x_panw_coa_bp_rationale_statement": "WildFire analyzes files that have already been downloaded and possibly executed. A WildFire verdict of malicious indicates that a computer could already be infected. In addition, because WildFire only analyzes files it has not already seen that were not flagged by the firewall’s antivirus filter, files deemed malicious by WildFire are more likely to evade detection by desktop antivirus products.",
      "x_panw_coa_bp_remediation_procedure": "From GUI, configure some combination of the following Server Profiles:\n\nConfigure the Email Server:\nSelect `Device > Server Profiles > Email`\nClick `Add` \nEnter a name for the Profile. \nSelect the virtual system from the Location drop down menu (if applicable) \nClick `Add`\n\nConfigure the Syslog Server: \nSelect `Device > Server Profiles > Syslog > Add` \nEnter `Name, Display Name, Syslog Server, Transport, Port, Format, Facility` \nClick `OK` \nClick `Commit` to save the configuration\n\nConfigure the SMTP Server: \nSelect `Device > Server Profiles > Email` \nSelect `Add, Name, Display Name, From, To, Additional Recipients, Gateway IP or Hostname` \nClick `OK` \nClick `Commit` to save the configuration\n\nNavigate to `Objects, Log Forwarding`\nChoose `Add`, set the log type to 'wildfire', add the filter '(verdict neq benign)', then add log destinations for SNMP, Syslog, Email or HTTP as required.",
      "x_panw_coa_bp_audit_procedure": "Navigate to `Objects > Log Forwarding`.\n\nVerify that the `WildFire` log type is configured to generate alerts using the desired alerting mechanism(s).",
      "x_panw_coa_bp_cis_controls": [
        "TITLE:Deploy Network-based Anti-malware Tools CONTROL:v6 8.5 DESCRIPTION:Use network-based anti-malware tools to identify executables in all network traffic and use techniques other than signature-based detection to identify and filter out malicious content before it arrives at the endpoint.;TITLE:Ensure Network Boundary Devices Log Verbosely CONTROL:v6 6.5 DESCRIPTION:Configure network boundary devices, including firewalls, network-based IPS, and inbound and outbound proxies, to verbosely log all traffic (both allowed and blocked) arriving at the device.;TITLE:Activate audit logging CONTROL:v7 6.2 DESCRIPTION:Ensure that local logging has been enabled on all systems and networking devices.;TITLE:Malware Defenses CONTROL:v7 8 DESCRIPTION:Malware Defenses;TITLE:Central Log Management CONTROL:v7 6.5 DESCRIPTION:Ensure that appropriate logs are being aggregated to a central log management system for analysis and review.;TITLE:Centralize Anti-malware Logging CONTROL:v7 8.6 DESCRIPTION:Send all malware detection events to enterprise anti-malware administration tools and event log servers for analysis and alerting.;"
      ],
      "x_panw_coa_bp_references": [
        "“WildFire Email Alerts: Subscribe or Add Additional Recipients” - https://live.paloaltonetworks.com/docs/DOC-7740:“Wildfire Administrator's Guide 9.0 (English)' - https://docs.paloaltonetworks.com/wildfire/9-0/wildfire-admin.html"
      ]
    },
    {
      "type": "course-of-action",
      "id": "course-of-action--ae18aab6-0a08-4c09-9a97-6c6ef58061a7",
      "name": "Enable DNS Security in Anti-Spyware profile",
      "created": "2020-06-23T19:50:31.722Z",
      "modified": "2020-06-26T13:02:55.804Z",
      "x_panw_coa_u42_id": "x.1",
      "x_panw_coa_u42_title": "Enable DNS Security in Anti-Spyware profile"
    },
    {
      "type": "course-of-action",
      "id": "course-of-action--b1f31bc6-40cd-4c64-805f-1680eda35801",
      "name": "Ensure 'SSL Forward Proxy Policy' for traffic destined to the Internet is configured",
      "created": "2020-06-23T19:50:31.722Z",
      "modified": "2020-06-26T19:00:11.067Z",
      "description": "Configure SSL Forward Proxy for all traffic destined to the Internet. In most organizations, including all categories except `financial-services`, `government` and `health-and-medicine` is recommended.",
      "x_panw_coa_bp_section_number": "8",
      "x_panw_coa_bp_recommendation_number": "8.1",
      "x_panw_coa_bp_title": "Ensure 'SSL Forward Proxy Policy' for traffic destined to the Internet is configured",
      "x_panw_coa_bp_status": "published",
      "x_panw_coa_bp_scoring_status": "full",
      "x_panw_coa_bp_description": "Configure SSL Forward Proxy for all traffic destined to the Internet. In most organizations, including all categories except `financial-services`, `government` and `health-and-medicine` is recommended.",
      "x_panw_coa_bp_rationale_statement": "Without SSL inspection, the firewall cannot apply many of its protection features against encrypted traffic. The amount of encrypted malware traffic continues to rise, and legitimate websites using SSL encryption are hacked or tricked into delivering malware on a frequent basis. As encryption on the Internet continues to grow at a rapid rate, SSL inspection is no longer optional as a practical security measure. If proper decryption is not configured, it follows that the majority of traffic is not being fully inspected for malicious content or policy violations. This is a major exposure, allowing delivery of exploits and payloads direct to user desktops.",
      "x_panw_coa_bp_remediation_procedure": "Navigate to `Policies > Decryption`.\nCreate a Policy for all traffic destined to the Internet. This Policy should include:\n- `Source` tab: The `Source Zone` and/or `Source Address` should include all target internal networks. `Source User` should include all target internal users\n- `Destination` tab: The `Destination Zone` should include the untrusted target zone (usually the `internet`). `Destination Address` is typically `Any` for an internet destination.\n- `Service/URL Category` tab: all `URL Category` entries should be included except `financial-services`, `government` and `health-and-medicine` (this list may vary depending on your organization and its policies).\n- `Options` tab: `Type` set to `SSL Forward Proxy`",
      "x_panw_coa_bp_audit_procedure": "Navigate to `Policies > Decryption`.\nVerify `SSL Forward Proxy` is set for all traffic destined to the Internet. \n\nVerify each Decryption Policy Rule:\n- `Source` tab: The `Source Zone` and/or `Source Address` should include all target internal networks. `Source User` should include all target internal users\n- `Destination` tab: The `Destination Zone` should include the untrusted target zone (usually the `internet`). `Destination Address` is typically `Any` for an internet destination.\n- `Service/URL Category` tab: Verify that all `URL Category` entries are included except `financial-services`, `government` and `health-and-medicine` (this list may vary depending on your organization and its policies).\n- `Options` tab: Verify that the `Type` is set to `SSL Forward Proxy`",
      "x_panw_coa_bp_impact_statement": "Failure to decrypt outbound traffic allows attackers to mask attacks, data exfiltration and/or command and control (C2) traffic by simply using standard TLS encryption.\nPrivacy concerns for your organization's users will dictate that some common categories should be exempted from inspection and decryption. Personal banking or healthcare information is almost always exempted, as are interactions with government entities. Exemptions and inclusions to decryption policies should be negotiated internally and governed by published Corporate Policies.",
      "x_panw_coa_bp_cis_controls": [
        "TITLE:Design Network Perimeters To Leverage Proxy CONTROL:v6 12.5 DESCRIPTION:Design and implement network perimeters so that all outgoing network traffic to the Internet must pass through at least one application layer filtering proxy server. The proxy should support decrypting network traffic, logging individual TCP sessions, blocking specific URLs, domain names, and IP addresses to implement a black list, and applying whitelists of allowed sites that can be accessed through the proxy while blocking all other sites. Organizations should force outbound traffic to the Internet through an authenticated proxy server on the enterprise perimeter.;TITLE:Boundary Defense CONTROL:v6 12 DESCRIPTION:Boundary Defense;TITLE:Deploy Application Layer Filtering Proxy Server CONTROL:v7 12.9 DESCRIPTION:Ensure that all network traffic to or from the Internet passes through an authenticated application layer proxy that is configured to filter unauthorized connections.;TITLE:Decrypt Network Traffic at Proxy CONTROL:v7 12.10 DESCRIPTION:Decrypt all encrypted network traffic at the boundary proxy prior to analyzing the content. However, the organization may use whitelists of allowed sites that can be accessed through the proxy without decrypting the traffic.;TITLE:Boundary Defense CONTROL:v7 12 DESCRIPTION:Boundary Defense;"
      ],
      "x_panw_coa_bp_references": [
        "“How to Implement SSL Decryption” - https://live.paloaltonetworks.com/docs/DOC- 1412:““PAN-OS Administrator's Guide 9.0 (English) - Decryption (English)” - https://docs.paloaltonetworks.com/pan-os/9-0/pan-os-admin/decryption.html#"
      ]
    },
    {
      "type": "course-of-action",
      "id": "course-of-action--b4ed79f9-b72c-4423-9a9c-f29134fda870",
      "name": "Ensure that the Certificate used for Decryption is Trusted",
      "created": "2020-06-23T19:50:31.722Z",
      "modified": "2020-06-26T19:00:11.068Z",
      "description": "The CA Certificate used for in-line HTTP Man in the Middle should be trusted by target users. For `SSL Forward Proxy` configurations, there are classes of users that need to be considered.\n\n1: Users that are members of the organization, users of machines under control of the organization. For these people and machines, ensure that the CA Certificate is in one of the Trusted CA certificate stores. This is easily done in Active Directory, using Group Policies for instance. A MDM (Mobile Device Manager) can be used to accomplish the same task for mobile devices such as telephones or tablets. Other central management or orchestration tools can be used for Linux or 'IoT' (Internet of Things) devices.\n\n2: Users that are not member of the organization - often these are classed as 'Visitors' in the policies of the organization. If a public CA Certificate is a possibility for your organization, then that is one approach. A second approach is to not decrypt affected traffic - this is easily done, but leaves the majority of 'visitor' traffic uninspected and potentially carrying malicious content. The final approach, and the one most commonly seen, is to use the same certificate as is used for the hosting organization. In this last case, visitors will see a certificate warning, but the issuing CA will be the organization that they are visiting.",
      "x_panw_coa_bp_section_number": "8",
      "x_panw_coa_bp_recommendation_number": "8.3",
      "x_panw_coa_bp_title": "Ensure that the Certificate used for Decryption is Trusted",
      "x_panw_coa_bp_status": "published",
      "x_panw_coa_bp_scoring_status": "not_scored",
      "x_panw_coa_bp_description": "The CA Certificate used for in-line HTTP Man in the Middle should be trusted by target users. For `SSL Forward Proxy` configurations, there are classes of users that need to be considered.\n\n1: Users that are members of the organization, users of machines under control of the organization. For these people and machines, ensure that the CA Certificate is in one of the Trusted CA certificate stores. This is easily done in Active Directory, using Group Policies for instance. A MDM (Mobile Device Manager) can be used to accomplish the same task for mobile devices such as telephones or tablets. Other central management or orchestration tools can be used for Linux or 'IoT' (Internet of Things) devices.\n\n2: Users that are not member of the organization - often these are classed as 'Visitors' in the policies of the organization. If a public CA Certificate is a possibility for your organization, then that is one approach. A second approach is to not decrypt affected traffic - this is easily done, but leaves the majority of 'visitor' traffic uninspected and potentially carrying malicious content. The final approach, and the one most commonly seen, is to use the same certificate as is used for the hosting organization. In this last case, visitors will see a certificate warning, but the issuing CA will be the organization that they are visiting.",
      "x_panw_coa_bp_rationale_statement": "Using a self-signed certificate, or any certificate that generates a warning in the browser, means that members of the organization have no method of determining if they are being presented with a legitimate certificate, or an attacker's 'man in the middle' certificate. It also very rapidly teaches members of the organization to bypass all security warnings of this type.",
      "x_panw_coa_bp_remediation_procedure": "Set the CA Certificate(s):\n\nNavigate to `Device > Certificate Management > Certificates`. Import the appropriate CA Certificates from any internal Certificate Authorities. \n\nAlternatively, generate a self-signed certificate for an internal CA on the firewall, and then import the root certificate for that CA into the trusted CA list of target clients. In an Active Directory environment this can be facilitated using a Group Policy.\n\nSet the Certificate Profile needed for the SSL Forward Proxy:\n- Navigate to `Device > Certificate Management > Certificate Profile`.\n\nSet the decryption profile to include the settings described in the `SSL Forward Proxy` guidance in this document",
      "x_panw_coa_bp_audit_procedure": "Verify the CA Certificate(s): \n\nNavigate to `Device > Certificate Management > Certificates`\n- Verify that appropriate internal certificates are imported, and that all certificates in the list are valid. In particular, verify the `Subject`, `Issuer`, `CA`, `Expires`, `Algorithm` and `Usage` fields\n- Alternatively, if an internal CA is implemented on the firewall, verify that target clients have the root certificate for this CA imported into their list of trusted certificate authorities.\n\nVerify the Certificate Profile needed for the SSL Forward Proxy:\n- Navigate to `Device > Certificate Management > Certificate Profile`. Verify that an appropriate profile is created.",
      "x_panw_coa_bp_cis_controls": [
        "TITLE:Design Network Perimeters To Leverage Proxy CONTROL:v6 12.5 DESCRIPTION:Design and implement network perimeters so that all outgoing network traffic to the Internet must pass through at least one application layer filtering proxy server. The proxy should support decrypting network traffic, logging individual TCP sessions, blocking specific URLs, domain names, and IP addresses to implement a black list, and applying whitelists of allowed sites that can be accessed through the proxy while blocking all other sites. Organizations should force outbound traffic to the Internet through an authenticated proxy server on the enterprise perimeter.;TITLE:Deploy Application Layer Filtering Proxy Server CONTROL:v7 12.9 DESCRIPTION:Ensure that all network traffic to or from the Internet passes through an authenticated application layer proxy that is configured to filter unauthorized connections.;TITLE:Decrypt Network Traffic at Proxy CONTROL:v7 12.10 DESCRIPTION:Decrypt all encrypted network traffic at the boundary proxy prior to analyzing the content. However, the organization may use whitelists of allowed sites that can be accessed through the proxy without decrypting the traffic.;TITLE:Boundary Defense CONTROL:v6 12 DESCRIPTION:Boundary Defense;TITLE:Boundary Defense CONTROL:v7 12 DESCRIPTION:Boundary Defense;"
      ],
      "x_panw_coa_bp_references": [
        "How to Implement and Test SSL Decryption' - https://live.paloaltonetworks.com/t5/Configuration-Articles/How-to-Implement-and-Test-SSL-Decryption/ta-p/59719:“PAN-OS Administrator's Guide 9.0 (English) - Decryption (English)” - https://docs.paloaltonetworks.com/pan-os/9-0/pan-os-admin/decryption.html#:'SSL Certificates Resource List on Configuring and Troubleshooting' - https://live.paloaltonetworks.com/t5/Management-Articles/SSL-certificates-resource-list/ta-p/53068:'Certificates' - http://palo-alto.wikia.com/wiki/Certificates"
      ]
    },
    {
      "type": "course-of-action",
      "id": "course-of-action--befa473a-9ac8-4ff8-b0fe-be0e47821896",
      "name": "Ensure a secure antivirus profile is applied to all relevant security policies",
      "created": "2020-06-23T19:50:31.722Z",
      "modified": "2020-06-26T13:02:55.803Z",
      "description": "Create a secure antivirus profile and apply it to all security policies that could pass HTTP, SMTP, IMAP, POP3, FTP, or SMB traffic. The antivirus profile may be applied to the security policies directly or through a profile group.",
      "x_panw_coa_bp_section_number": "6",
      "x_panw_coa_bp_recommendation_number": "6.2",
      "x_panw_coa_bp_title": "Ensure a secure antivirus profile is applied to all relevant security policies",
      "x_panw_coa_bp_status": "published",
      "x_panw_coa_bp_scoring_status": "full",
      "x_panw_coa_bp_description": "Create a secure antivirus profile and apply it to all security policies that could pass HTTP, SMTP, IMAP, POP3, FTP, or SMB traffic. The antivirus profile may be applied to the security policies directly or through a profile group.",
      "x_panw_coa_bp_rationale_statement": "By applying a secure antivirus profile to all applicable traffic, the threat of malware propagation through the firewall is greatly reduced. Without an antivirus profile assigned to any potential hostile zone, the first protection in the path against malware is removed, leaving in most cases only the desktop endpoint protection application to detect and remediate any potential malware.",
      "x_panw_coa_bp_remediation_procedure": "Navigate to `Policies > Security `.\nFor each policy, navigate to `[Policy Name] > Actions`\n\nSet an `Antivirus profile` or a `Profile Group` containing an AV profile for each security policy passing traffic - regardless of protocol.",
      "x_panw_coa_bp_audit_procedure": "Navigate to `Policies > Security `.\nFor each policy, navigate to `[Policy Name] > Actions`\nVerify there is a secure `Antivirus profile` applied to all security policies passing traffic - regardless of protocol. This can be set by Profiles or by Profile Group.",
      "x_panw_coa_bp_impact_statement": "Not having an AV Profile on a Security Policy allows signature-based malware to transit the security boundary without blocks or alerts. In most cases this leaves only the Endpoint Security application to block or alert malware.",
      "x_panw_coa_bp_cis_controls": [
        "TITLE:Deploy Network-based Anti-malware Tools CONTROL:v6 8.5 DESCRIPTION:Use network-based anti-malware tools to identify executables in all network traffic and use techniques other than signature-based detection to identify and filter out malicious content before it arrives at the endpoint.;TITLE:Malware Defenses CONTROL:v7 8 DESCRIPTION:Malware Defenses;"
      ],
      "x_panw_coa_bp_references": [
        "“PAN-OS Administrator's Guide 9.0 (English) - Security Policies ” - https://docs.paloaltonetworks.com/pan-os/9-0/pan-os-admin/policy/security-policy.html:“PAN-OS Administrator's Guide 9.0 (English) - Security Profiles” - https://docs.paloaltonetworks.com/pan-os/9-0/pan-os-admin/policy/security-profiles.html"
      ]
    },
    {
      "type": "course-of-action",
      "id": "course-of-action--c45b79a8-2d29-4d8c-95ab-acea7e478e50",
      "name": "Ensure DNS sinkholing is configured on all anti-spyware profiles in use",
      "created": "2020-06-23T19:50:31.722Z",
      "modified": "2020-06-26T13:02:55.804Z",
      "description": "Configure DNS sinkholing for all anti-spyware profiles in use. All internal requests to the selected sinkhole IP address must traverse the firewall. Any device attempting to communicate with the DNS sinkhole IP address should be considered infected.",
      "x_panw_coa_bp_section_number": "6",
      "x_panw_coa_bp_recommendation_number": "6.4",
      "x_panw_coa_bp_title": "Ensure DNS sinkholing is configured on all anti-spyware profiles in use",
      "x_panw_coa_bp_status": "published",
      "x_panw_coa_bp_scoring_status": "full",
      "x_panw_coa_bp_description": "Configure DNS sinkholing for all anti-spyware profiles in use. All internal requests to the selected sinkhole IP address must traverse the firewall. Any device attempting to communicate with the DNS sinkhole IP address should be considered infected.",
      "x_panw_coa_bp_rationale_statement": "DNS sinkholing helps to identify infected clients by spoofing DNS responses for malware domain queries. Without sinkholing, the DNS server itself may be seen as infected, while the truly infected device remains unidentified. In addition, sinkholing also ensures that DNS queries that might be indicators of compromise do not transit the internet, where they could be potentially used to negatively impact the 'ip reputation' of the organization's internet network subnets.",
      "x_panw_coa_bp_remediation_procedure": "Navigate to `Objects > Security Profiles > Anti-Spyware`.\n\nWithin the each anti-spyware profile, under its `DNS Signatures` tab, set the `DNS Signature Source` List:\n`Palo Alto Networks Content DNS Signatures` should have as its `Action on DNS Queries` set to `sinkhole`\nIf licensed, the `Palo Alto Networks Cloud DNS Security` should have as its `Action on DNS Queries` set to `sinkhole`\n\nVerify the '`Sinkhole IPv4`' IP address is correct. This should be set to `sinkhole.paloaltnetworks.com`, or if an internal host is set then that host IP or FQDN should be in that field\n\nVerify the '`Sinkhole IPv6`' IP address is correct. This should be set to `IPv6 Loopback IP (::1)`, or if an internal DNS Sinkhole host is set then that host IP or FQDN should be in that field\n\nNavigate to `Policies > Security Policies`\nFor each outbound security Policy, in the `Actions` tab, set the `Anti-Spyware` setting to include the Spyware Profile created, either explicitly or as a `Group Profile`",
      "x_panw_coa_bp_audit_procedure": "Navigate to `Objects > Security Profiles > Anti-Spyware`.\n\nWithin the each anti-spyware profile, under its `DNS Signatures` tab, verify the `DNS Signature Source` List:\n`Palo Alto Networks Content DNS Signatures` should have as its `Action on DNS Queries` set to `sinkhole`\nIf licensed, the `Palo Alto Networks Cloud DNS Security` should have as its `Action on DNS Queries` set to `sinkhole`\n\nVerify the '`Sinkhole IPv4`' IP address is correct. This should be set to `sinkhole.paloaltnetworks.com`, or if an internal host is set then that host IP or FQDN should be in that field\n\nVerify the '`Sinkhole IPv6`' IP address is correct. This should be set to `IPv6 Loopback IP (::1)`, or if an internal DNS Sinkhole host is set then that host IP or FQDN should be in that field\n\nNavigate to `Policies > Security Policies`\nFor each outbound security Policy, in the `Actions` tab, verify that the `Anti-Spyware` setting includes the Spyware Profile created, either explicitly or as a `Group Profile`\n\nTo verify correct operation of DNS Security, from an internal station make a DNS request to each of the following hosts:\n- `test-malware.testpanw.com` to test `Malware` DNS Signature checks\n- `test-c2.testpanw.com` to test `C2` DNS Signature checks\n- `test-dga.testpanw.com` to test `DGA` (Domain Generation Algorithm) DNS attack checks \n- `test-dnstun.testpanw.com` to test `DNS Tunneling` attack checks\nEach of these DNS requests should be redirected to the configured DNS Sinkhole server IP address\nEach of these DNS requests should appear in the firewall logs, under `Monitor > Logs > Threat`. If configured, each of these requests should generate an alert in the organization's SIEM.",
      "x_panw_coa_bp_cis_controls": [
        "TITLE:Enabled DNS Query Logging CONTROL:v6 8.6 DESCRIPTION:Enable domain name system (DNS) query logging to detect hostname lookup for known malicious C2 domains.;TITLE:Deploy Network-based Anti-malware Tools CONTROL:v6 8.5 DESCRIPTION:Use network-based anti-malware tools to identify executables in all network traffic and use techniques other than signature-based detection to identify and filter out malicious content before it arrives at the endpoint.;TITLE:Enable DNS Query Logging CONTROL:v7 8.7 DESCRIPTION:Enable Domain Name System (DNS) query logging to detect hostname lookups for known malicious domains.;TITLE:Malware Defenses CONTROL:v7 8 DESCRIPTION:Malware Defenses;"
      ],
      "x_panw_coa_bp_references": [
        "“How to Deal with Conficker using DNS Sinkhole” - https://live.paloaltonetworks.com/docs/DOC-6628:“Threat Prevention Deployment Tech Note” - https://live.paloaltonetworks.com/docs/DOC-3094:'PANOS Administrator's Guide 9.0 (English) - Security Profiles': https://docs.paloaltonetworks.com/pan-os/9-0/pan-os-admin/policy/security-profiles.html:'PAN-OS Administrator's Guide 9.0 (English) - DNS Security' - https://docs.paloaltonetworks.com/pan-os/9-0/pan-os-admin/threat-prevention/dns-security.html#"
      ]
    },
    {
      "type": "course-of-action",
      "id": "course-of-action--c5148c0d-4c4a-4ad6-b2c7-942f9eb91673",
      "name": "Deploy XSOAR Playbook - PAN-OS Query Logs for Indicators",
      "created": "2020-06-23T19:50:31.722Z",
      "modified": "2020-06-26T13:02:55.805Z",
      "x_panw_coa_u42_id": "x.23",
      "x_panw_coa_u42_title": "Deploy XSOAR Playbook - PAN-OS Query Logs for Indicators"
    },
    {
      "type": "course-of-action",
      "id": "course-of-action--d3c39d4c-3074-4350-832e-9eea942ac353",
      "name": "Ensure application security policies exist when allowing traffic from an untrusted zone to a more trusted zone",
      "created": "2020-06-23T19:50:31.722Z",
      "modified": "2020-06-26T13:02:55.805Z",
      "description": "When permitting traffic from an untrusted zone, such as the Internet or guest network, to a more trusted zone, such as a DMZ segment, create security policies specifying which specific applications are allowed. \n\n**Enhanced Security Recommendation: **\nRequire specific application policies when allowing `any` traffic, regardless of the trust level of a zone. Do not rely solely on port permissions. This may require SSL interception, and may also not be possible in all environments.",
      "x_panw_coa_bp_section_number": "7",
      "x_panw_coa_bp_recommendation_number": "7.1",
      "x_panw_coa_bp_title": "Ensure application security policies exist when allowing traffic from an untrusted zone to a more trusted zone",
      "x_panw_coa_bp_status": "published",
      "x_panw_coa_bp_scoring_status": "full",
      "x_panw_coa_bp_description": "When permitting traffic from an untrusted zone, such as the Internet or guest network, to a more trusted zone, such as a DMZ segment, create security policies specifying which specific applications are allowed. \n\n**Enhanced Security Recommendation: **\nRequire specific application policies when allowing `any` traffic, regardless of the trust level of a zone. Do not rely solely on port permissions. This may require SSL interception, and may also not be possible in all environments.",
      "x_panw_coa_bp_rationale_statement": "To avoid unintentionally exposing systems and services, rules allowing traffic from untrusted zones to trusted zones should be as specific as possible. Application-based rules, as opposed to service/port rules, further tighten what traffic is allowed to pass.\nSimilarly, traffic from trusted to untrusted networks should have a security policy set, with application-based rules. A 'catch-all' rule that allows all applications will also allow malware traffic. The goal should be to understand both inbound and outbound traffic, permit what is known, and block all other traffic.",
      "x_panw_coa_bp_remediation_procedure": "Navigate to `Policies > Security`. \n\nFor all `Security Policies` that transit from a less trusted to a more trusted interface, set the `Application` and `Service` values to match the exposed application. For instance, for a web server exposed to the internet from a DMZ:\n`Source` tab: `Zone` set to `OUTSIDE` / `Address` set to `Any` \n`Destination` tab: `Zone` set to `DMZ` / `Address` set to `[DMZ Host Object]` \n`Application` tab: set to `web-browsing` \n`Service/URL Category` tab: set `Service` to ether:\n- `application-default`\nor:\n- `service-http` and/or `service-https`\n\n**Enhanced Security Recommendation: **\n\nSet these values for Policies on all Interfaces, for traffic in all directions. For each `Security Policy`, set the `Application` and `Service` values to match the exposed application.",
      "x_panw_coa_bp_audit_procedure": "Navigate to `Policies > Security`. \n\nFor all Security Policies that transit from a less trusted to a more trusted interface, that the appropriate `Application` and `Service` values are set. For instance, for a web server exposed to the internet from a DMZ:\n`Source` tab: `Zone` set to `OUTSIDE` / `Address` set to `Any` \n`Destination` tab: `Zone` set to `DMZ` / `Address` set to `[DMZ Host Object]` \n`Application` tab: set to `web-browsing` \n`Service/URL Category` tab: set `Service` to ether:\n- `application-default`\nor:\n- `service-http` and/or `service-https`\n\n**Enhanced Security Recommendation: **\n\nAssess this setting for Policies on all Interfaces, for traffic in all directions. Ensure that for each Security Policy that the appropriate settings are set for both `Application` and `Service`",
      "x_panw_coa_bp_impact_statement": "Setting application based rules on both inbound and outbound traffic ensures that the traffic on the protocol and port being specified is actually the application that you expect. For outbound traffic, the days of 'we trust our users' is well past us, that statement also implies that we trust the malware on the user workstations, which is obviously not the case. \nFor traffic from trusted to less trusted interfaces, the applications should be characterized over time, with the end goal being that all applications in in the rules, and a final 'block all' rule is in place. \nNot having this goal gives both attackers and malware the leeway they need to accomplish their goals. \nTrusting only Port permissions to control traffic exposes an organization to 'tunneling' style attacks that can exfiltrate data or facilitate Command and Control (C2) sessions.",
      "x_panw_coa_bp_cis_controls": [
        "TITLE:Controlled Access Based on the Need to Know CONTROL:v6 14 DESCRIPTION:Controlled Access Based on the Need to Know;TITLE:Controlled Access Based on the Need to Know CONTROL:v7 14 DESCRIPTION:Controlled Access Based on the Need to Know;"
      ],
      "x_panw_coa_bp_references": [
        "“PAN-OS Administrator's Guide 9.0 (English) - Security Policies / Applications and Usage ” - https://docs.paloaltonetworks.com/pan-os/9-0/pan-os-web-interface-help/policies/policies-security/applications-and-usage.html#"
      ]
    },
    {
      "type": "course-of-action",
      "id": "course-of-action--d84f79f8-219c-43cb-a918-ab7dd235413a",
      "name": "Ensure a secure anti-spyware profile is applied to all security policies permitting traffic to the Internet",
      "created": "2020-06-23T19:50:31.722Z",
      "modified": "2020-06-26T13:02:55.804Z",
      "description": "Create one or more anti-spyware profiles and collectively apply them to all security policies permitting traffic to the Internet. The anti-spyware profiles may be applied to the security policies directly or through a profile group.",
      "x_panw_coa_bp_section_number": "6",
      "x_panw_coa_bp_recommendation_number": "6.6",
      "x_panw_coa_bp_title": "Ensure a secure anti-spyware profile is applied to all security policies permitting traffic to the Internet",
      "x_panw_coa_bp_status": "published",
      "x_panw_coa_bp_scoring_status": "full",
      "x_panw_coa_bp_description": "Create one or more anti-spyware profiles and collectively apply them to all security policies permitting traffic to the Internet. The anti-spyware profiles may be applied to the security policies directly or through a profile group.",
      "x_panw_coa_bp_rationale_statement": "By applying secure anti-spyware profiles to all applicable traffic, the threat of sensitive data exfiltration or command-and-control traffic successfully passing through the firewall is greatly reduced. Anti-spyware profiles are not restricted to particular protocols like antivirus profiles, so anti-spyware profiles should be applied to all security policies permitting traffic to the Internet. Assigning an anti-spyware profile to each trusted zone will quickly and easily identify trusted hosts that have been infected with spyware, by identifying the infection from their outbound network traffic. In addition, that outbound network traffic will be blocked by the profile.",
      "x_panw_coa_bp_remediation_procedure": "Navigate to `Objects > Security Profiles > Anti-Spyware`.\n\nAlso navigate to `Policies > Security`.\n\nSet one or more anti-spyware profiles to collectively apply to all inside to outside traffic from any address to any address and any application and service.",
      "x_panw_coa_bp_audit_procedure": "Navigate to `Objects > Security Profiles > Anti-Spyware`.\n\nAlso navigate to `Policies > Security`.\n\nVerify there are one or more anti-spyware profiles that collectively apply to all inside to outside traffic from any address to any address and any application and service.",
      "x_panw_coa_bp_cis_controls": [
        "TITLE:Deploy Network-based Anti-malware Tools CONTROL:v6 8.5 DESCRIPTION:Use network-based anti-malware tools to identify executables in all network traffic and use techniques other than signature-based detection to identify and filter out malicious content before it arrives at the endpoint.;TITLE:Malware Defenses CONTROL:v7 8 DESCRIPTION:Malware Defenses;"
      ],
      "x_panw_coa_bp_references": [
        "“Threat Prevention Deployment Tech Note” - https://live.paloaltonetworks.com/docs/DOC-3094:“PAN-OS Administrator's Guide 9.0 (English) - Security Profiles” - https://docs.paloaltonetworks.com/pan-os/9-0/pan-os-admin/policy/security-profiles.html"
      ]
    },
    {
      "type": "course-of-action",
      "id": "course-of-action--dff22e97-a89e-4ff7-b615-0165258bf8d5",
      "name": "Ensure all HTTP Header Logging options are enabled",
      "created": "2020-06-23T19:50:31.722Z",
      "modified": "2020-06-26T13:02:55.804Z",
      "description": "Enable all options (User-Agent, Referer, and X-Forwarded-For) for HTTP header logging.",
      "x_panw_coa_bp_section_number": "6",
      "x_panw_coa_bp_recommendation_number": "6.12",
      "x_panw_coa_bp_title": "Ensure all HTTP Header Logging options are enabled",
      "x_panw_coa_bp_status": "published",
      "x_panw_coa_bp_scoring_status": "full",
      "x_panw_coa_bp_description": "Enable all options (User-Agent, Referer, and X-Forwarded-For) for HTTP header logging.",
      "x_panw_coa_bp_rationale_statement": "Logging HTTP header information provides additional information in the URL logs, which may be useful during forensic investigations. The User-Agent option logs which browser was used during the web session, which could provide insight to the vector used for malware retrieval. The Referer option logs the source webpage responsible for referring the user to the logged webpage. The X-Forwarded-For option is useful for preserving the user’s source IP address, such as if a user traverses a proxy server prior to the firewall. Un-checking the Log container page only box produces substantially more information about web activity, with the expense of producing far more entries in the URL logs. If this option remains checked, a URL filter log entry showing details of a malicious file download may not exist.",
      "x_panw_coa_bp_remediation_procedure": "Navigate to `Objects > Security Profiles > URL Filtering > URL Filtering Profile > URL Filtering Settings`.\n\nSet the following four settings:\n\n a. `Log container page only` box is un-checked\n\n b. Check the `User-Agent` box\n\n c. Check the `Referer` box\n\n d. Check the `X-Forwarded-For` box",
      "x_panw_coa_bp_audit_procedure": "Navigate to `Objects > Security Profiles > URL Filtering > URL Filtering Profile > URL Filtering Settings`.\n\nVerify these four settings:\n\n a. `Log container page only` box is un-checked\n\n b. `User-Agent` box is checked\n\n c. `Referer` box is checked\n\n d. `X-Forwarded-For` box is checked",
      "x_panw_coa_bp_impact_statement": "Not having an effective URL Filtering configuration can leave an organization open to legal action, internal HR issues, non-compliance with regulatory policies or productivity loss.",
      "x_panw_coa_bp_cis_controls": [
        "TITLE:Log All URL Requests From Systems CONTROL:v6 7.4 DESCRIPTION:Log all URL requests from each of the organization's systems, whether onsite or a mobile device, in order to identify potentially malicious activity and assist incident handlers with identifying potentially compromised systems.;TITLE:Ensure Network Boundary Devices Log Verbosely CONTROL:v6 6.5 DESCRIPTION:Configure network boundary devices, including firewalls, network-based IPS, and inbound and outbound proxies, to verbosely log all traffic (both allowed and blocked) arriving at the device.;TITLE:Log all URL requests CONTROL:v7 7.6 DESCRIPTION:Log all URL requests from each of the organization's systems, whether onsite or a mobile device, in order to identify potentially malicious activity and assist incident handlers with identifying potentially compromised systems.;TITLE:Activate audit logging CONTROL:v7 6.2 DESCRIPTION:Ensure that local logging has been enabled on all systems and networking devices.;TITLE:Enable Detailed Logging CONTROL:v7 6.3 DESCRIPTION:Enable system logging to include detailed information such as an event source, date, user, timestamp, source addresses, destination addresses, and other useful elements.;"
      ],
      "x_panw_coa_bp_references": [
        "“PAN-OS Administrator's Guide 9.0 (English) - URL Filtering Best Practices': https://docs.paloaltonetworks.com/pan-os/9-0/pan-os-admin/url-filtering/url-filtering-best-practices.html"
      ]
    },
    {
      "type": "course-of-action",
      "id": "course-of-action--ef5f68d8-9522-40b4-890c-31ece644687d",
      "name": "Ensure 'WildFire Update Schedule' is set to download and install updates every minute",
      "created": "2020-06-23T19:50:31.722Z",
      "modified": "2020-06-26T13:02:55.804Z",
      "description": "Set the WildFire update schedule to download and install updates every minute.",
      "x_panw_coa_bp_section_number": "5",
      "x_panw_coa_bp_recommendation_number": "5.7",
      "x_panw_coa_bp_title": "Ensure 'WildFire Update Schedule' is set to download and install updates every minute",
      "x_panw_coa_bp_status": "published",
      "x_panw_coa_bp_scoring_status": "full",
      "x_panw_coa_bp_description": "Set the WildFire update schedule to download and install updates every minute.",
      "x_panw_coa_bp_rationale_statement": "WildFire definitions may contain signatures to block immediate, active threats to the environment. With a 1 minute update schedule, the firewall can ensure threats with new definitions are quickly mitigated.",
      "x_panw_coa_bp_remediation_procedure": "Navigate to `Device > Dynamic Updates > WildFire Update Schedule`.\n\nSet `Action` to `Download and Install`.\n\nSet `Recurrence` to `Every Minute`.",
      "x_panw_coa_bp_audit_procedure": "Navigate to `Device > Dynamic Updates > WildFire Update Schedule`.\n\nVerify that `Action` is set to `Download and Install`.\n\nVerify that `Recurrence` is set to `Every Minute`.",
      "x_panw_coa_bp_cis_controls": [
        "TITLE:Boundary Defense CONTROL:v6 12 DESCRIPTION:Boundary Defense;TITLE:Deploy Network-based Anti-malware Tools CONTROL:v6 8.5 DESCRIPTION:Use network-based anti-malware tools to identify executables in all network traffic and use techniques other than signature-based detection to identify and filter out malicious content before it arrives at the endpoint.;TITLE:Use Automated Patch Management And Software Update Tools CONTROL:v6 4.5 DESCRIPTION:Deploy automated patch management tools and software update tools for operating system and software/applications on all systems for which such tools are available and safe. Patches should be applied to all systems, even systems that are properly air gapped.;TITLE:Deploy Automated Operating System Patch Management Tools CONTROL:v7 3.4 DESCRIPTION:Deploy automated software update tools in order to ensure that the operating systems are running the most recent security updates provided by the software vendor.;TITLE:Deploy Automated Software Patch Management Tools CONTROL:v7 3.5 DESCRIPTION:Deploy automated software update tools in order to ensure that third-party software on all systems is running the most recent security updates provided by the software vendor.;TITLE:Boundary Defense CONTROL:v7 12 DESCRIPTION:Boundary Defense;"
      ],
      "x_panw_coa_bp_references": [
        "“Wildfire Administrator's Guide 9.0 (English)' - https://docs.paloaltonetworks.com/wildfire/9-0/wildfire-admin.html:“How to Configure WildFire” - https://live.paloaltonetworks.com/docs/DOC-3252:“Tips for Managing Content Updates” - https://live.paloaltonetworks.com/docs/DOC- 1578"
      ]
    },
    {
      "type": "course-of-action",
      "id": "course-of-action--f4a8da12-c6f0-4a33-ae42-590c5602be99",
      "name": "Ensure secure URL filtering is enabled for all security policies allowing traffic to the Internet",
      "created": "2020-06-23T19:50:31.722Z",
      "modified": "2020-06-26T13:02:55.804Z",
      "description": "Apply a secure URL filtering profile to all security policies permitting traffic to the Internet. The URL Filtering profile may be applied to the security policies directly or through a profile group.",
      "x_panw_coa_bp_section_number": "6",
      "x_panw_coa_bp_recommendation_number": "6.13",
      "x_panw_coa_bp_title": "Ensure secure URL filtering is enabled for all security policies allowing traffic to the Internet",
      "x_panw_coa_bp_status": "published",
      "x_panw_coa_bp_scoring_status": "full",
      "x_panw_coa_bp_description": "Apply a secure URL filtering profile to all security policies permitting traffic to the Internet. The URL Filtering profile may be applied to the security policies directly or through a profile group.",
      "x_panw_coa_bp_rationale_statement": "URL Filtering policies dramatically reduce the risk of users visiting malicious or inappropriate websites. In addition, a complete URL history log for all devices is invaluable when performing forensic analysis in the event of a security incident. Applying complete and approved URL filtering to outbound traffic is a frequent requirement in corporate policies, legal requirements or regulatory requirements.",
      "x_panw_coa_bp_remediation_procedure": "To Set URL Filtering:\nFor each Security Profile that transits traffic to the internet, navigate to `Policies > Security > Security Profiles > [Policy Name] > Actions`.\n\nSet a URL Filtering profile that complies with the policies of the organization is applied to all Security Policies that transit traffic to the public internet.",
      "x_panw_coa_bp_audit_procedure": "To Verify URL Filtering:\n\nFor each Security Policy that transits traffic to the public internet, navigate to `Policies > Security > Security Profiles > [Policy Name] > Actions`.\n\nVerify there is a URL Filtering profile that complies with the policies of the organization is applied to all Security Policies that transit traffic to the public internet.",
      "x_panw_coa_bp_impact_statement": "Not having an effective URL Filtering configuration can leave an organization open to legal action, internal HR issues, non-compliance with regulatory policies or productivity loss.",
      "x_panw_coa_bp_cis_controls": [
        "TITLE:Deploy, Use, And Maintain Network-based URL Filters CONTROL:v6 7.6 DESCRIPTION:The organization shall maintain and enforce network based URL filters that limit a system's ability to connect to websites not approved by the organization. The organization shall subscribe to URL categorization services to ensure that they are up-to-date with the most recent website category definitions available. Uncategorized sites shall be blocked by default. This filtering shall be enforced for each of the organization's systems, whether they are physically at an organization's facilities or not.;TITLE:Maintain and Enforce Network-Based URL Filters CONTROL:v7 7.4 DESCRIPTION:Enforce network-based URL filters that limit a system's ability to connect to websites not approved by the organization. This filtering shall be enforced for each of the organization's systems, whether they are physically at an organization's facilities or not.;TITLE:Subscribe to URL-Categorization service CONTROL:v7 7.5 DESCRIPTION:Subscribe to URL categorization services to ensure that they are up-to-date with the most recent website category definitions available. Uncategorized sites shall be blocked by default.;"
      ],
      "x_panw_coa_bp_references": [
        "“PAN-OS Administrator's Guide 9.0 (English) - URL Filtering Best Practices': https://docs.paloaltonetworks.com/pan-os/9-0/pan-os-admin/url-filtering/url-filtering-best-practices.html"
      ]
    },
    {
      "type": "course-of-action",
      "id": "course-of-action--f4d50de0-ecc5-4f9e-b8f7-214cdfe28d39",
      "name": "Ensure forwarding is enabled for all applications and file types in WildFire file blocking profiles",
      "created": "2020-06-23T19:50:31.722Z",
      "modified": "2020-06-26T13:02:55.804Z",
      "description": "Set Applications and File Types fields to any in WildFire file blocking profiles. With a WildFire license, seven file types are supported, while only PE (Portable Executable) files are supported without a license.\nFor the 'web browsing' application, the action 'continue' can be selected. This still forwards the file to the Wildfire service, but also presents the end user with a confirmation message before they receive the file. Selecting 'continue' for any other application will block the file (because the end user will not see the prompt).\nIf there is a 'continue' rule, there should still be an 'any traffic / any application / forward' rule after that in the list.",
      "x_panw_coa_bp_section_number": "5",
      "x_panw_coa_bp_recommendation_number": "5.2",
      "x_panw_coa_bp_title": "Ensure forwarding is enabled for all applications and file types in WildFire file blocking profiles",
      "x_panw_coa_bp_status": "published",
      "x_panw_coa_bp_scoring_status": "full",
      "x_panw_coa_bp_description": "Set Applications and File Types fields to any in WildFire file blocking profiles. With a WildFire license, seven file types are supported, while only PE (Portable Executable) files are supported without a license.\nFor the 'web browsing' application, the action 'continue' can be selected. This still forwards the file to the Wildfire service, but also presents the end user with a confirmation message before they receive the file. Selecting 'continue' for any other application will block the file (because the end user will not see the prompt).\nIf there is a 'continue' rule, there should still be an 'any traffic / any application / forward' rule after that in the list.",
      "x_panw_coa_bp_rationale_statement": "Selecting 'Any' application and file type ensures WildFire is analyzing as many files as possible.",
      "x_panw_coa_bp_remediation_procedure": "Navigate to `Objects > Security Profiles > File Blocking`.\n\nSet a rule so that `Applications` is set to `any`, `File Type` is set to `any`, and `Action` is set to `forward`.",
      "x_panw_coa_bp_audit_procedure": "Navigate to `Objects > Security Profiles > File Blocking`.\n\nVerify an appropriate rule exists with `Applications` set to `any`, `File Type` set to `any`, and `Action` set to `forward`.",
      "x_panw_coa_bp_cis_controls": [
        "TITLE:Deploy Network-based Anti-malware Tools CONTROL:v6 8.5 DESCRIPTION:Use network-based anti-malware tools to identify executables in all network traffic and use techniques other than signature-based detection to identify and filter out malicious content before it arrives at the endpoint.;TITLE:Malware Defenses CONTROL:v7 8 DESCRIPTION:Malware Defenses;"
      ],
      "x_panw_coa_bp_references": [
        "““Wildfire Administrator's Guide 9.0 (English) -WildFire Best Practices” - https://docs.paloaltonetworks.com/wildfire/9-0/wildfire-admin/wildfire-deployment-best-practices/wildfire-best-practices.html#"
      ]
    },
    {
      "type": "course-of-action",
      "id": "course-of-action--fd0da09e-a0b2-4018-9476-1a7edd809b59",
      "name": "Ensure forwarding of decrypted content to WildFire is enabled",
      "created": "2020-06-23T19:50:31.722Z",
      "modified": "2020-06-26T13:02:55.804Z",
      "description": "Allow the firewall to forward decrypted content to WildFire. Note that SSL Forward-Proxy must also be enabled and configured for this setting to take effect on inside-to-outside traffic flows.",
      "x_panw_coa_bp_section_number": "5",
      "x_panw_coa_bp_recommendation_number": "5.4",
      "x_panw_coa_bp_title": "Ensure forwarding of decrypted content to WildFire is enabled",
      "x_panw_coa_bp_status": "published",
      "x_panw_coa_bp_scoring_status": "full",
      "x_panw_coa_bp_description": "Allow the firewall to forward decrypted content to WildFire. Note that SSL Forward-Proxy must also be enabled and configured for this setting to take effect on inside-to-outside traffic flows.",
      "x_panw_coa_bp_rationale_statement": "As encrypted Internet traffic continues to proliferate, WildFire becomes less effective unless it is allowed to act on decrypted content. For example, if a user downloads a malicious pdf over SSL, WildFire can only provide analysis if 1) the session is decrypted by the firewall and 2) forwarding of decrypted content is enabled. In today's internet, roughly 70-80% of all user traffic is encrypted. If Wildfire is not configured to analyze encrypted content, the effectiveness of Wildfire is drastically reduced.",
      "x_panw_coa_bp_remediation_procedure": "Navigate to `Device > Setup > Content-ID > Content-ID Settings`.\n\nSet `Allow forwarding of decrypted content` to be checked.\nNote that SSL Forward Proxy must be configured for this setting to be effective.",
      "x_panw_coa_bp_audit_procedure": "Navigate to `Device > Setup > Content-ID > Content-ID Settings`.\n\nVerify that `Allow forwarding of decrypted content` is checked.",
      "x_panw_coa_bp_cis_controls": [
        "TITLE:Design Network Perimeters To Leverage Proxy CONTROL:v6 12.5 DESCRIPTION:Design and implement network perimeters so that all outgoing network traffic to the Internet must pass through at least one application layer filtering proxy server. The proxy should support decrypting network traffic, logging individual TCP sessions, blocking specific URLs, domain names, and IP addresses to implement a black list, and applying whitelists of allowed sites that can be accessed through the proxy while blocking all other sites. Organizations should force outbound traffic to the Internet through an authenticated proxy server on the enterprise perimeter.;TITLE:Deploy Application Layer Filtering Proxy Server CONTROL:v7 12.9 DESCRIPTION:Ensure that all network traffic to or from the Internet passes through an authenticated application layer proxy that is configured to filter unauthorized connections.;TITLE:Decrypt Network Traffic at Proxy CONTROL:v7 12.10 DESCRIPTION:Decrypt all encrypted network traffic at the boundary proxy prior to analyzing the content. However, the organization may use whitelists of allowed sites that can be accessed through the proxy without decrypting the traffic.;TITLE:Deploy Network-based Anti-malware Tools CONTROL:v6 8.5 DESCRIPTION:Use network-based anti-malware tools to identify executables in all network traffic and use techniques other than signature-based detection to identify and filter out malicious content before it arrives at the endpoint.;TITLE:Malware Defenses CONTROL:v7 8 DESCRIPTION:Malware Defenses;TITLE:Malware Defenses CONTROL:v6 8 DESCRIPTION:Malware Defenses;"
      ],
      "x_panw_coa_bp_references": [
        "“WildFire Fails Forwarding File to Cloud for Encrypted Traffic” - https://live.paloaltonetworks.com/docs/DOC-6845:“Wildfire Administrator's Guide 9.0 (English) - Forward Decrypted SSL Traffic for Wildfire Analysis' - https://docs.paloaltonetworks.com/wildfire/9-0/wildfire-admin/submit-files-for-wildfire-analysis/forward-decrypted-ssl-traffic-for-wildfire-analysis.html#:“Wildfire Administrator's Guide 9.0 (English) - Wildfire Best Practices' - https://docs.paloaltonetworks.com/wildfire/9-0/wildfire-admin/wildfire-deployment-best-practices/wildfire-best-practices.html#"
      ]
    },
    {
      "type": "identity",
      "id": "identity--f24d9056-f704-43ee-b162-ac5744345fa2",
      "identity_class": "group",
      "name": "Identity (Watering Hole Attack Campaign)",
      "created": "2019-10-07T12:10:19.815Z",
      "modified": "2019-10-08T18:27:54.025Z",
      "sectors": [
        "education",
        "financial-services",
        "manufacturing",
        "retail",
        "technology"
      ],
      "x_cta_country": [
        "US"
      ]
    },
    {
      "type": "indicator",
      "id": "indicator--1226ebbd-c85f-4cd1-aa95-914993812bc2",
      "created": "2019-07-16T16:31:10.881Z",
      "modified": "2019-07-25T12:33:21.156Z",
      "name": "ccfe61a28f35161c19340541dfd839075e31cd3b661f0936a4c667d805a65136",
      "pattern": "[file:hashes.'SHA-256' = 'ccfe61a28f35161c19340541dfd839075e31cd3b661f0936a4c667d805a65136']",
      "valid_from": "2019-07-16T16:31:10.881Z",
      "labels": [
        "malicious-activity"
      ]
    },
    {
      "type": "indicator",
      "id": "indicator--23dc3ecc-5a82-4fc2-817a-eca4b25dcb74",
      "created": "2019-05-07T17:41:22.432Z",
      "modified": "2019-08-26T13:59:02.774Z",
      "name": "www.aanon.com.tw/flash/diff.exe",
      "pattern": "[url:value = 'www.aanon.com.tw/flash/diff.exe']",
      "valid_from": "2019-05-07T17:41:22.432Z",
      "labels": [
        "malicious-activity"
      ]
    },
    {
      "type": "indicator",
      "id": "indicator--2ea18706-2e08-41be-b0d8-0446ac16d14e",
      "created": "2019-07-16T16:31:10.881Z",
      "modified": "2019-11-06T19:52:42.728Z",
      "name": "7f39e5b9d46386dd8142ef40ae526343274bdd5f27e38c07b457d290a277e807",
      "pattern": "[file:hashes.'SHA-256' = '7f39e5b9d46386dd8142ef40ae526343274bdd5f27e38c07b457d290a277e807']",
      "valid_from": "2019-07-16T16:31:10.881Z",
      "labels": [
        "malicious-activity"
      ]
    },
    {
      "type": "indicator",
      "id": "indicator--562e634f-b0db-4186-877c-f22561788478",
      "created": "2019-05-07T17:39:17.214Z",
      "modified": "2019-07-25T12:33:21.155Z",
      "name": "www.npec.com.tw/flash/diff.exe",
      "pattern": "[url:value = 'www.npec.com.tw/flash/diff.exe']",
      "valid_from": "2019-05-07T17:39:17.214Z",
      "labels": [
        "malicious-activity"
      ]
    },
    {
      "type": "indicator",
      "id": "indicator--7400c925-265c-45cd-bbb6-bfde1449520e",
      "created": "2019-05-07T17:42:06.721Z",
      "modified": "2019-08-26T13:56:59.542Z",
      "name": "www.ep66.com.tw/setup.exe",
      "pattern": "[url:value = 'www.ep66.com.tw/setup.exe']",
      "valid_from": "2019-05-07T17:42:06.721Z",
      "labels": [
        "malicious-activity"
      ]
    },
    {
      "type": "indicator",
      "id": "indicator--81bf4b2a-4cbf-4a01-bab1-8cea8ac405c5",
      "created": "2019-05-07T17:42:38.059Z",
      "modified": "2019-08-26T13:56:53.927Z",
      "name": "140.112.158.132/phpmyadmin/test/AppletLow.jar",
      "pattern": "[url:value = '140.112.158.132/phpmyadmin/test/AppletLow.jar']",
      "valid_from": "2019-05-07T17:42:38.059Z",
      "labels": [
        "malicious-activity"
      ]
    },
    {
      "type": "indicator",
      "id": "indicator--99df9df1-c265-404f-8f0f-bedba3d45e97",
      "created": "2019-05-07T17:41:44.935Z",
      "modified": "2019-08-26T13:57:05.236Z",
      "name": "uyghurweb.net/player/PYvBte.jar",
      "pattern": "[url:value = 'uyghurweb.net/player/PYvBte.jar']",
      "valid_from": "2019-05-07T17:41:44.935Z",
      "labels": [
        "malicious-activity"
      ]
    },
    {
      "type": "indicator",
      "id": "indicator--b81ea8b1-62ac-4743-912b-75ce8edd98f6",
      "created": "2019-08-26T13:59:19.941Z",
      "modified": "2019-10-08T18:27:54.025Z",
      "name": "uyghurweb.net/player/gmuweb.exe",
      "pattern": "[url:value = 'uyghurweb.net/player/gmuweb.exe']",
      "valid_from": "2019-08-26T13:59:19.941Z",
      "labels": [
        "malicious-activity"
      ]
    },
    {
      "type": "indicator",
      "id": "indicator--cf2518ce-3a5b-444b-8044-b2a900949b5c",
      "created": "2019-05-07T17:44:23.279Z",
      "modified": "2019-07-25T12:33:21.156Z",
      "name": "9d149baceaaff2a67161fec9b8978abc22f0a73a1c8ce87edf6e2fb673ac7374",
      "pattern": "[file:hashes.'SHA-256' = '9d149baceaaff2a67161fec9b8978abc22f0a73a1c8ce87edf6e2fb673ac7374']",
      "valid_from": "2019-05-07T17:44:23.279Z",
      "labels": [
        "malicious-activity"
      ]
    },
    {
      "type": "indicator",
      "id": "indicator--f71d79a7-b9ba-4faa-9ee9-b3d49dc01015",
      "created": "2019-07-16T16:31:10.881Z",
      "modified": "2019-07-25T12:33:21.156Z",
      "name": "ba509a1d752f3165dc2821e0b1c6543c15988fd7abd4e56c6155de09d1640ce9",
      "pattern": "[file:hashes.'SHA-256' = 'ba509a1d752f3165dc2821e0b1c6543c15988fd7abd4e56c6155de09d1640ce9']",
      "valid_from": "2019-07-16T16:31:10.881Z",
      "labels": [
        "malicious-activity"
      ]
    },
    {
      "type": "indicator",
      "id": "indicator--fcd372a5-ae48-4c4c-8b39-84b3ae14e5a6",
      "created": "2019-07-16T16:31:10.881Z",
      "modified": "2019-11-06T19:52:42.728Z",
      "name": "e3d02e5f69d3c2092657d64c39aa0aea2a16ce804a47f3b5cf44774cde3166fe",
      "pattern": "[file:hashes.'SHA-256' = 'e3d02e5f69d3c2092657d64c39aa0aea2a16ce804a47f3b5cf44774cde3166fe']",
      "valid_from": "2019-07-16T16:31:10.881Z",
      "labels": [
        "malicious-activity"
      ]
    },
    {
      "type": "malware",
      "id": "malware--c7539b03-c5b9-47e9-a236-4f3b53a3ccfb",
      "name": "PoisonIvy",
      "labels": [
        "remote-access-trojan"
      ],
      "created": "2019-10-10T17:13:59.694Z",
      "modified": "2019-10-14T17:57:38.035Z"
    },
    {
      "type": "relationship",
      "id": "relationship--0021f86a-b604-4cbf-b48d-ad778ce6fcf0",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:11.075Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--c5148c0d-4c4a-4ad6-b2c7-942f9eb91673",
      "target_ref": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add",
      "x_panw_coa_u42_panw_product": [
        "XSOAR"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--0032cd5c-1284-4852-9ab3-9d23a3c98d36",
      "created": "2019-07-16T16:31:11.385Z",
      "modified": "2019-07-25T12:33:21.157Z",
      "relationship_type": "indicates",
      "source_ref": "indicator--fcd372a5-ae48-4c4c-8b39-84b3ae14e5a6",
      "target_ref": "campaign--352e36e2-33ad-4065-a080-f13778ce9593"
    },
    {
      "type": "relationship",
      "id": "relationship--04dd51c4-aaa5-4128-bf07-1e8ebfa23681",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:11.075Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--d3c39d4c-3074-4350-832e-9eea942ac353",
      "target_ref": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add",
      "x_panw_coa_u42_panw_product": [
        "NGFW"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--068ee331-72ba-45b0-9dc5-e785e116fdb4",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:11.076Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--b1f31bc6-40cd-4c64-805f-1680eda35801",
      "target_ref": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add",
      "x_panw_coa_u42_panw_product": [
        "NGFW"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--076d5ade-2e17-4fac-9884-78e285587a0b",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:11.077Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--60e78a97-dcc6-4d67-a310-ed7f16e0218a",
      "target_ref": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add",
      "x_panw_coa_u42_panw_product": [
        "Cortex XDR Prevent"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--0e80709c-a2c8-4b54-9769-562f1d0405ef",
      "created": "2019-05-01T15:51:04.377Z",
      "modified": "2020-07-30T16:55:40.805Z",
      "relationship_type": "attributed-to",
      "source_ref": "report--0e80709c-a2c8-4b54-9769-562f1d0405ef",
      "target_ref": "intrusion-set--90ba5c1f-2704-487c-8da9-523fcd023d5a"
    },
    {
      "type": "relationship",
      "id": "relationship--10c0838e-c6ee-42d4-aa07-c3310216490d",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:19.150Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--fd0da09e-a0b2-4018-9476-1a7edd809b59",
      "target_ref": "attack-pattern--42e8de7b-37b2-4258-905a-6897815e58e0",
      "x_panw_coa_u42_panw_product": [
        "Wildfire"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--13b67387-cd61-47a5-803c-a6c5f77c9e03",
      "created": "2019-05-07T17:42:06.945Z",
      "modified": "2019-07-25T12:33:21.157Z",
      "relationship_type": "indicates",
      "source_ref": "indicator--7400c925-265c-45cd-bbb6-bfde1449520e",
      "target_ref": "campaign--352e36e2-33ad-4065-a080-f13778ce9593"
    },
    {
      "type": "relationship",
      "id": "relationship--15515310-419b-452d-8040-1f59b9443ae1",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:11.075Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--fd0da09e-a0b2-4018-9476-1a7edd809b59",
      "target_ref": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add",
      "x_panw_coa_u42_panw_product": [
        "Wildfire"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--181b970c-5dca-4937-ac0f-30bcca4b4932",
      "created": "2019-05-07T17:42:38.256Z",
      "modified": "2019-07-25T12:33:21.157Z",
      "relationship_type": "indicates",
      "source_ref": "indicator--81bf4b2a-4cbf-4a01-bab1-8cea8ac405c5",
      "target_ref": "campaign--352e36e2-33ad-4065-a080-f13778ce9593"
    },
    {
      "type": "relationship",
      "id": "relationship--1af23f08-4b44-42ea-8faf-77281714416b",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:19.150Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--8190ac5a-8a5e-41bc-85dd-62e0f5cdd2ba",
      "target_ref": "attack-pattern--42e8de7b-37b2-4258-905a-6897815e58e0",
      "x_panw_coa_u42_panw_product": [
        "Wildfire"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--1bd24773-9d45-470d-bfa6-bdd4ff735a31",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:15.015Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--44bfcc9e-cb15-499f-b0fe-3c41e2c2655e",
      "target_ref": "attack-pattern--d742a578-d70e-4d0e-96a6-02a9c30204e6",
      "x_panw_coa_u42_panw_product": [
        "XSOAR"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--24a16eeb-2ab2-49aa-ade9-1c23bf7da12c",
      "created": "2019-07-16T16:31:11.385Z",
      "modified": "2019-07-25T12:33:21.157Z",
      "relationship_type": "indicates",
      "source_ref": "indicator--2ea18706-2e08-41be-b0d8-0446ac16d14e",
      "target_ref": "campaign--352e36e2-33ad-4065-a080-f13778ce9593"
    },
    {
      "type": "relationship",
      "id": "relationship--262bc6f7-1167-4b5f-8f0d-622e9c38ce02",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:11.077Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--f4a8da12-c6f0-4a33-ae42-590c5602be99",
      "target_ref": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add",
      "x_panw_coa_u42_panw_product": [
        "URL Filtering"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--337e66c7-67aa-4e0c-8d7a-1cf28adeb77f",
      "created": "2019-05-07T17:41:22.592Z",
      "modified": "2019-07-25T12:33:21.157Z",
      "relationship_type": "uses",
      "description": "Compromised site for Watering hole attacks. ",
      "source_ref": "indicator--23dc3ecc-5a82-4fc2-817a-eca4b25dcb74",
      "target_ref": "attack-pattern--d742a578-d70e-4d0e-96a6-02a9c30204e6"
    },
    {
      "type": "relationship",
      "id": "relationship--352e36e2-33ad-4065-a080-f13778ce9593",
      "created": "2019-05-01T15:51:07.709Z",
      "modified": "2019-10-15T15:00:35.247Z",
      "relationship_type": "attributed-to",
      "source_ref": "campaign--352e36e2-33ad-4065-a080-f13778ce9593",
      "target_ref": "intrusion-set--90ba5c1f-2704-487c-8da9-523fcd023d5a"
    },
    {
      "type": "relationship",
      "id": "relationship--3950e32e-d243-4f21-8cce-7938d4f3c9ed",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:11.075Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--8190ac5a-8a5e-41bc-85dd-62e0f5cdd2ba",
      "target_ref": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add",
      "x_panw_coa_u42_panw_product": [
        "Wildfire"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--3a1e4e8a-b2b3-4b8b-9d9d-08f406482031",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:15.015Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--fd0da09e-a0b2-4018-9476-1a7edd809b59",
      "target_ref": "attack-pattern--d742a578-d70e-4d0e-96a6-02a9c30204e6",
      "x_panw_coa_u42_panw_product": [
        "Wildfire"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--3d924f97-d12f-4cb6-b163-08aac65a84e7",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:11.075Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--55e53da8-b2ba-4bba-a641-c5c75a023bb5",
      "target_ref": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add",
      "x_panw_coa_u42_panw_product": [
        "NGFW"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--42e8de7b-37b2-4258-905a-6897815e58e0",
      "created": "2019-05-01T15:51:07.709Z",
      "modified": "2019-10-15T15:00:35.247Z",
      "relationship_type": "uses",
      "source_ref": "campaign--352e36e2-33ad-4065-a080-f13778ce9593",
      "target_ref": "attack-pattern--42e8de7b-37b2-4258-905a-6897815e58e0"
    },
    {
      "type": "relationship",
      "id": "relationship--42f7f9f0-37a9-4416-913f-ded7cb6b9013",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:15.015Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--ef5f68d8-9522-40b4-890c-31ece644687d",
      "target_ref": "attack-pattern--d742a578-d70e-4d0e-96a6-02a9c30204e6",
      "x_panw_coa_u42_panw_product": [
        "Wildfire"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--449d7ee9-b7b3-4a0f-ba31-d24aea6e1afb",
      "created": "2019-07-16T16:31:11.385Z",
      "modified": "2019-07-25T12:33:21.157Z",
      "relationship_type": "uses",
      "description": "Dropped PoisonIvy variant. ",
      "source_ref": "indicator--f71d79a7-b9ba-4faa-9ee9-b3d49dc01015",
      "target_ref": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add"
    },
    {
      "type": "relationship",
      "id": "relationship--459c3262-49ba-48cf-86ca-e632cc7994f1",
      "created": "2019-05-07T17:42:06.945Z",
      "modified": "2019-07-25T12:33:21.157Z",
      "relationship_type": "uses",
      "description": "Compromised site for Watering hole attacks. ",
      "source_ref": "indicator--7400c925-265c-45cd-bbb6-bfde1449520e",
      "target_ref": "attack-pattern--d742a578-d70e-4d0e-96a6-02a9c30204e6"
    },
    {
      "type": "relationship",
      "id": "relationship--469e47cb-817d-4e52-b194-df44dd1a4f5e",
      "created": "2019-07-16T16:31:11.385Z",
      "modified": "2019-07-25T12:33:21.157Z",
      "relationship_type": "uses",
      "description": "Dropped PoisonIvy variant. ",
      "source_ref": "indicator--2ea18706-2e08-41be-b0d8-0446ac16d14e",
      "target_ref": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add"
    },
    {
      "type": "relationship",
      "id": "relationship--49ba3ce9-ac14-4cd7-8c71-8040dc0af86e",
      "created": "2019-07-16T16:31:11.385Z",
      "modified": "2019-07-25T12:33:21.157Z",
      "relationship_type": "indicates",
      "source_ref": "indicator--f71d79a7-b9ba-4faa-9ee9-b3d49dc01015",
      "target_ref": "campaign--352e36e2-33ad-4065-a080-f13778ce9593"
    },
    {
      "type": "relationship",
      "id": "relationship--4cf245e5-64ec-4412-b184-f41f914c333e",
      "created": "2019-10-10T17:14:06.031Z",
      "modified": "2019-10-14T17:02:54.838Z",
      "relationship_type": "indicates",
      "source_ref": "indicator--f71d79a7-b9ba-4faa-9ee9-b3d49dc01015",
      "target_ref": "malware--c7539b03-c5b9-47e9-a236-4f3b53a3ccfb"
    },
    {
      "type": "relationship",
      "id": "relationship--50de5812-75d8-4ec0-ae79-27da69b41881",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:15.015Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--ae18aab6-0a08-4c09-9a97-6c6ef58061a7",
      "target_ref": "attack-pattern--d742a578-d70e-4d0e-96a6-02a9c30204e6",
      "x_panw_coa_u42_panw_product": [
        "DNS Security"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--5387a44c-2972-47cb-bf77-bde968557e20",
      "created": "2019-07-16T16:31:11.385Z",
      "modified": "2019-07-25T12:33:21.157Z",
      "relationship_type": "indicates",
      "source_ref": "indicator--1226ebbd-c85f-4cd1-aa95-914993812bc2",
      "target_ref": "campaign--352e36e2-33ad-4065-a080-f13778ce9593"
    },
    {
      "type": "relationship",
      "id": "relationship--59a9e88d-f828-47c3-9f30-c9c5a658dbe0",
      "created": "2019-10-07T12:10:20.035Z",
      "modified": "2019-10-08T18:27:54.026Z",
      "relationship_type": "targets",
      "source_ref": "campaign--352e36e2-33ad-4065-a080-f13778ce9593",
      "target_ref": "identity--f24d9056-f704-43ee-b162-ac5744345fa2"
    },
    {
      "type": "relationship",
      "id": "relationship--5aaad24c-bf6e-4dc4-90bb-18dbbf515626",
      "created": "2019-08-26T13:59:20.221Z",
      "modified": "2019-10-08T18:27:54.026Z",
      "relationship_type": "indicates",
      "source_ref": "indicator--b81ea8b1-62ac-4743-912b-75ce8edd98f6",
      "target_ref": "campaign--352e36e2-33ad-4065-a080-f13778ce9593"
    },
    {
      "type": "relationship",
      "id": "relationship--5c6da0f1-a447-488f-ae6e-a23d931265a7",
      "created": "2019-05-07T17:39:17.332Z",
      "modified": "2019-07-25T12:33:21.157Z",
      "relationship_type": "indicates",
      "source_ref": "indicator--562e634f-b0db-4186-877c-f22561788478",
      "target_ref": "campaign--352e36e2-33ad-4065-a080-f13778ce9593"
    },
    {
      "type": "relationship",
      "id": "relationship--5d22d838-1cb1-4204-9e1a-a55a754ffe59",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:11.075Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--38519f4f-e6e8-454b-a3f5-b46daef0e316",
      "target_ref": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add",
      "x_panw_coa_u42_panw_product": [
        "XSOAR"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--5d8a9ab0-8598-4b75-ae57-8e684862cde8",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:19.149Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--f4d50de0-ecc5-4f9e-b8f7-214cdfe28d39",
      "target_ref": "attack-pattern--42e8de7b-37b2-4258-905a-6897815e58e0",
      "x_panw_coa_u42_panw_product": [
        "Wildfire"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--5e99bd2b-db13-40a1-9a21-ab96a7550beb",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:11.076Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--2c886776-61fb-487c-a880-41f4b7195627",
      "target_ref": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add",
      "x_panw_coa_u42_panw_product": [
        "URL Filtering"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--61212ee6-3daf-429d-bd56-d15390130cb5",
      "created": "2019-08-26T13:59:20.221Z",
      "modified": "2019-10-10T17:13:24.734Z",
      "relationship_type": "uses",
      "description": "Compromised site for Watering hole attacks. ",
      "source_ref": "indicator--b81ea8b1-62ac-4743-912b-75ce8edd98f6",
      "target_ref": "attack-pattern--d742a578-d70e-4d0e-96a6-02a9c30204e6"
    },
    {
      "type": "relationship",
      "id": "relationship--64c1592b-1624-49f1-a973-5c340715c0ad",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:15.015Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--79fd0d10-6272-4191-8b8d-9c72f19358d0",
      "target_ref": "attack-pattern--d742a578-d70e-4d0e-96a6-02a9c30204e6",
      "x_panw_coa_u42_panw_product": [
        "Wildfire"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--65626653-b0c1-44be-bf7e-c8bea3afa7cc",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:15.015Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--5e951942-0565-46f4-b09e-80426812b6b5",
      "target_ref": "attack-pattern--d742a578-d70e-4d0e-96a6-02a9c30204e6",
      "x_panw_coa_u42_panw_product": [
        "URL Filtering"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--6706e446-ce53-4b02-aafb-50dff2c0015d",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:15.015Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--55e53da8-b2ba-4bba-a641-c5c75a023bb5",
      "target_ref": "attack-pattern--d742a578-d70e-4d0e-96a6-02a9c30204e6",
      "x_panw_coa_u42_panw_product": [
        "NGFW"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--685d35a9-5470-4234-a3af-39167a958782",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:11.076Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--b4ed79f9-b72c-4423-9a9c-f29134fda870",
      "target_ref": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add",
      "x_panw_coa_u42_panw_product": [
        "NGFW"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--6d360481-23c9-42e3-b4ce-cc0f344c68a6",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:19.149Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--befa473a-9ac8-4ff8-b0fe-be0e47821896",
      "target_ref": "attack-pattern--42e8de7b-37b2-4258-905a-6897815e58e0",
      "x_panw_coa_u42_panw_product": [
        "Threat Prevention"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--6f763c9e-736b-4d03-83c1-9bfa1823c18e",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:15.015Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--645c6c45-116e-4265-98d2-e30f56325bc6",
      "target_ref": "attack-pattern--d742a578-d70e-4d0e-96a6-02a9c30204e6",
      "x_panw_coa_u42_panw_product": [
        "Threat Prevention"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--76b2ee51-168c-4270-96de-97e4e22fd98c",
      "created": "2019-07-16T16:31:11.385Z",
      "modified": "2019-07-25T12:33:21.158Z",
      "relationship_type": "uses",
      "description": "Dropped PoisonIvy variant. ",
      "source_ref": "indicator--1226ebbd-c85f-4cd1-aa95-914993812bc2",
      "target_ref": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add"
    },
    {
      "type": "relationship",
      "id": "relationship--7877f6f7-f6ff-4142-ada6-3b05b8825738",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:11.076Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--5839cd6c-7897-43c4-82f3-5c03096a51c4",
      "target_ref": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add",
      "x_panw_coa_u42_panw_product": [
        "Threat Prevention"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--7926b19e-fde0-4c0b-a9bd-7a3b86a493be",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:15.015Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--8190ac5a-8a5e-41bc-85dd-62e0f5cdd2ba",
      "target_ref": "attack-pattern--d742a578-d70e-4d0e-96a6-02a9c30204e6",
      "x_panw_coa_u42_panw_product": [
        "Wildfire"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--798d3fdd-590b-4b01-a440-ba27c6d20f0d",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:11.077Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--dff22e97-a89e-4ff7-b615-0165258bf8d5",
      "target_ref": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add",
      "x_panw_coa_u42_panw_product": [
        "URL Filtering"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--7be13991-f221-48d4-b64d-ef1f343660db",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:11.075Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--ef5f68d8-9522-40b4-890c-31ece644687d",
      "target_ref": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add",
      "x_panw_coa_u42_panw_product": [
        "Wildfire"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--7c78b490-5275-4de6-8983-5a8c7672eead",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:11.075Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--a592acb0-98ba-4a8e-a5cf-2e78d2806e75",
      "target_ref": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add",
      "x_panw_coa_u42_panw_product": [
        "Wildfire"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--7faf64d7-f4c1-4fa7-a15b-50a9b91cd90f",
      "created": "2019-05-07T17:41:45.204Z",
      "modified": "2019-07-25T12:33:21.157Z",
      "relationship_type": "indicates",
      "source_ref": "indicator--99df9df1-c265-404f-8f0f-bedba3d45e97",
      "target_ref": "campaign--352e36e2-33ad-4065-a080-f13778ce9593"
    },
    {
      "type": "relationship",
      "id": "relationship--828a7d43-0e73-42ec-8edf-64aa679c3208",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:11.075Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--a79d2365-61c7-48b9-b024-e2020b99bba0",
      "target_ref": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add",
      "x_panw_coa_u42_panw_product": [
        "Wildfire"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--850d6f45-7b76-4b1f-bf93-0fa011691b87",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:11.076Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--922b1227-c493-43f6-8b4a-ae6d6963eb8b",
      "target_ref": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add",
      "x_panw_coa_u42_panw_product": [
        "NGFW"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--8eab6c90-654b-474c-b40c-2b73170cce50",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:15.015Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--d3c39d4c-3074-4350-832e-9eea942ac353",
      "target_ref": "attack-pattern--d742a578-d70e-4d0e-96a6-02a9c30204e6",
      "x_panw_coa_u42_panw_product": [
        "NGFW"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--91044b6a-b5c4-4f1e-a6ba-6a1682870795",
      "created": "2019-10-10T17:14:17.488Z",
      "modified": "2019-10-14T17:02:54.838Z",
      "relationship_type": "indicates",
      "source_ref": "indicator--cf2518ce-3a5b-444b-8044-b2a900949b5c",
      "target_ref": "malware--c7539b03-c5b9-47e9-a236-4f3b53a3ccfb"
    },
    {
      "type": "relationship",
      "id": "relationship--915f1e1d-f8c4-4c19-b52b-4a574d94dadc",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:11.076Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--c45b79a8-2d29-4d8c-95ab-acea7e478e50",
      "target_ref": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add",
      "x_panw_coa_u42_panw_product": [
        "Threat Prevention"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--977f3f9e-e61e-4703-9307-0eb03c7897a6",
      "created": "2019-05-07T17:41:22.592Z",
      "modified": "2019-07-25T12:33:21.157Z",
      "relationship_type": "indicates",
      "source_ref": "indicator--23dc3ecc-5a82-4fc2-817a-eca4b25dcb74",
      "target_ref": "campaign--352e36e2-33ad-4065-a080-f13778ce9593"
    },
    {
      "type": "relationship",
      "id": "relationship--a1a1e92e-7e0c-465e-8991-d196f5c519f1",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:11.075Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--9bcdca50-296d-4032-8639-dc8bc56077a3",
      "target_ref": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add",
      "x_panw_coa_u42_panw_product": [
        "NGFW"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--a3684627-1af3-4943-8040-164ddd781392",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:15.015Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--dff22e97-a89e-4ff7-b615-0165258bf8d5",
      "target_ref": "attack-pattern--d742a578-d70e-4d0e-96a6-02a9c30204e6",
      "x_panw_coa_u42_panw_product": [
        "URL Filtering"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--a41f0737-5a35-4ffb-9600-0150b80e28c7",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:11.076Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--28f61b3c-18a6-4991-8a17-7cfcd388136c",
      "target_ref": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add",
      "x_panw_coa_u42_panw_product": [
        "NGFW"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--a9129405-7138-4f23-8743-012672006849",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:15.015Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--befa473a-9ac8-4ff8-b0fe-be0e47821896",
      "target_ref": "attack-pattern--d742a578-d70e-4d0e-96a6-02a9c30204e6",
      "x_panw_coa_u42_panw_product": [
        "Threat Prevention"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--af661f55-b3f5-40b3-a03d-0d52e9a656fc",
      "created": "2019-05-07T17:44:23.424Z",
      "modified": "2019-07-25T12:33:21.157Z",
      "relationship_type": "indicates",
      "source_ref": "indicator--cf2518ce-3a5b-444b-8044-b2a900949b5c",
      "target_ref": "campaign--352e36e2-33ad-4065-a080-f13778ce9593"
    },
    {
      "type": "relationship",
      "id": "relationship--b33c6f4c-ed01-4e83-b184-19c8faf1b8da",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:15.015Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--38519f4f-e6e8-454b-a3f5-b46daef0e316",
      "target_ref": "attack-pattern--d742a578-d70e-4d0e-96a6-02a9c30204e6",
      "x_panw_coa_u42_panw_product": [
        "XSOAR"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--b67115ad-5b05-417a-8930-5e03ae9c33e4",
      "created": "2019-10-10T17:14:11.854Z",
      "modified": "2019-10-14T17:02:54.838Z",
      "relationship_type": "indicates",
      "source_ref": "indicator--2ea18706-2e08-41be-b0d8-0446ac16d14e",
      "target_ref": "malware--c7539b03-c5b9-47e9-a236-4f3b53a3ccfb"
    },
    {
      "type": "relationship",
      "id": "relationship--bb4797cb-ebb7-4ea0-9c83-47cb6f14cdc8",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:11.077Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--2fd9769c-5e50-4528-985f-a1d117329991",
      "target_ref": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add",
      "x_panw_coa_u42_panw_product": [
        "URL Filtering"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--bc22b40c-ad02-4aa2-81ec-073af2b6efac",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:11.076Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--a1294d38-0f0d-4973-a949-f38cccbc7469",
      "target_ref": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add",
      "x_panw_coa_u42_panw_product": [
        "Threat Prevention"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--c0f12c46-47dd-4b9e-ae58-9a1ca3cba58e",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:11.075Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--44bfcc9e-cb15-499f-b0fe-3c41e2c2655e",
      "target_ref": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add",
      "x_panw_coa_u42_panw_product": [
        "XSOAR"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--c1691e91-4f32-46aa-be96-a98672d15829",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:19.150Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--a592acb0-98ba-4a8e-a5cf-2e78d2806e75",
      "target_ref": "attack-pattern--42e8de7b-37b2-4258-905a-6897815e58e0",
      "x_panw_coa_u42_panw_product": [
        "Wildfire"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--c2293c71-403a-4f70-b96a-3f317dd89e7b",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:15.015Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--2fd9769c-5e50-4528-985f-a1d117329991",
      "target_ref": "attack-pattern--d742a578-d70e-4d0e-96a6-02a9c30204e6",
      "x_panw_coa_u42_panw_product": [
        "URL Filtering"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--c75f376a-8f98-4ba8-8b9f-b93e830b8757",
      "created": "2019-05-07T17:39:17.332Z",
      "modified": "2019-07-25T12:33:21.157Z",
      "relationship_type": "uses",
      "description": "Compromised site for Watering hole attacks. ",
      "source_ref": "indicator--562e634f-b0db-4186-877c-f22561788478",
      "target_ref": "attack-pattern--d742a578-d70e-4d0e-96a6-02a9c30204e6"
    },
    {
      "type": "relationship",
      "id": "relationship--ca49a799-3db5-41e7-b529-d3f3442ab388",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:11.075Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--79fd0d10-6272-4191-8b8d-9c72f19358d0",
      "target_ref": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add",
      "x_panw_coa_u42_panw_product": [
        "Wildfire"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--ccee47c3-fa4c-4e4a-b655-7bdeb0e6bb86",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:15.015Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--2c886776-61fb-487c-a880-41f4b7195627",
      "target_ref": "attack-pattern--d742a578-d70e-4d0e-96a6-02a9c30204e6",
      "x_panw_coa_u42_panw_product": [
        "URL Filtering"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--d32a12b9-0939-4e6a-8f36-f87ae65fcf30",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:19.150Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--a79d2365-61c7-48b9-b024-e2020b99bba0",
      "target_ref": "attack-pattern--42e8de7b-37b2-4258-905a-6897815e58e0",
      "x_panw_coa_u42_panw_product": [
        "Wildfire"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--d3ea4e66-7802-4f40-bd25-48931b5a516b",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:11.077Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--5e951942-0565-46f4-b09e-80426812b6b5",
      "target_ref": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add",
      "x_panw_coa_u42_panw_product": [
        "URL Filtering"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--d553b2f1-c865-4f3e-9343-a0bd3e89678f",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:19.150Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--ef5f68d8-9522-40b4-890c-31ece644687d",
      "target_ref": "attack-pattern--42e8de7b-37b2-4258-905a-6897815e58e0",
      "x_panw_coa_u42_panw_product": [
        "Wildfire"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--d742a578-d70e-4d0e-96a6-02a9c30204e6",
      "created": "2019-05-01T15:51:07.709Z",
      "modified": "2019-10-15T15:00:35.247Z",
      "relationship_type": "uses",
      "source_ref": "campaign--352e36e2-33ad-4065-a080-f13778ce9593",
      "target_ref": "attack-pattern--d742a578-d70e-4d0e-96a6-02a9c30204e6"
    },
    {
      "type": "relationship",
      "id": "relationship--db2924b9-d352-4d92-8fa4-dd6bf40cc4a5",
      "created": "2019-05-07T17:41:45.204Z",
      "modified": "2019-07-25T12:33:21.157Z",
      "relationship_type": "uses",
      "description": "Compromised site for Watering hole attacks. ",
      "source_ref": "indicator--99df9df1-c265-404f-8f0f-bedba3d45e97",
      "target_ref": "attack-pattern--d742a578-d70e-4d0e-96a6-02a9c30204e6"
    },
    {
      "type": "relationship",
      "id": "relationship--de8e6a5f-70cd-4f01-9604-a9cfd6f6e5bc",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:11.076Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--d84f79f8-219c-43cb-a918-ab7dd235413a",
      "target_ref": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add",
      "x_panw_coa_u42_panw_product": [
        "Threat Prevention"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--de97227d-28fe-4018-a09b-d25d2faeebe8",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:11.075Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--f4d50de0-ecc5-4f9e-b8f7-214cdfe28d39",
      "target_ref": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add",
      "x_panw_coa_u42_panw_product": [
        "Wildfire"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--deb41095-070d-446a-811a-6ab574fc9022",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:15.015Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--51bcc0dd-f051-4786-aa93-429358ea6238",
      "target_ref": "attack-pattern--d742a578-d70e-4d0e-96a6-02a9c30204e6",
      "x_panw_coa_u42_panw_product": [
        "XSOAR"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--df7eee49-8b40-49e5-9a49-22783cc6e2fe",
      "created": "2019-05-07T17:44:23.424Z",
      "modified": "2019-07-11T14:18:24.048Z",
      "relationship_type": "uses",
      "description": "Shell payload masquerades as a copy of the ApacheBench tool made by the Apache Software Foundation.",
      "source_ref": "indicator--cf2518ce-3a5b-444b-8044-b2a900949b5c",
      "target_ref": "attack-pattern--42e8de7b-37b2-4258-905a-6897815e58e0"
    },
    {
      "type": "relationship",
      "id": "relationship--e0e37ccf-b773-4bb6-b1ac-638f2fea1982",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:19.149Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--645c6c45-116e-4265-98d2-e30f56325bc6",
      "target_ref": "attack-pattern--42e8de7b-37b2-4258-905a-6897815e58e0",
      "x_panw_coa_u42_panw_product": [
        "Threat Prevention"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--e3b9b2b3-2f68-4aad-b4ca-319912b75710",
      "created": "2019-10-10T17:14:14.667Z",
      "modified": "2019-10-14T17:02:54.838Z",
      "relationship_type": "indicates",
      "source_ref": "indicator--fcd372a5-ae48-4c4c-8b39-84b3ae14e5a6",
      "target_ref": "malware--c7539b03-c5b9-47e9-a236-4f3b53a3ccfb"
    },
    {
      "type": "relationship",
      "id": "relationship--e546809c-0d41-4c7f-9550-9afe35204ac7",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:19.149Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--79fd0d10-6272-4191-8b8d-9c72f19358d0",
      "target_ref": "attack-pattern--42e8de7b-37b2-4258-905a-6897815e58e0",
      "x_panw_coa_u42_panw_product": [
        "Wildfire"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--e6919abc-99f9-4c6c-95a5-14761e7b2add",
      "created": "2019-05-01T15:51:07.709Z",
      "modified": "2019-10-15T15:00:35.247Z",
      "relationship_type": "uses",
      "source_ref": "campaign--352e36e2-33ad-4065-a080-f13778ce9593",
      "target_ref": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add"
    },
    {
      "type": "relationship",
      "id": "relationship--e77e7044-d492-4e54-a6ec-db96f7407579",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:11.076Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--645c6c45-116e-4265-98d2-e30f56325bc6",
      "target_ref": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add",
      "x_panw_coa_u42_panw_product": [
        "Threat Prevention"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--e8357569-3261-4221-b833-480209bb25a4",
      "created": "2019-10-10T17:14:09.032Z",
      "modified": "2019-10-14T17:02:54.838Z",
      "relationship_type": "indicates",
      "source_ref": "indicator--1226ebbd-c85f-4cd1-aa95-914993812bc2",
      "target_ref": "malware--c7539b03-c5b9-47e9-a236-4f3b53a3ccfb"
    },
    {
      "type": "relationship",
      "id": "relationship--e8e21290-dfc5-46ca-9261-5a068d116967",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:15.015Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--21ce34c9-4220-41cf-85c7-bc289bb2c79d",
      "target_ref": "attack-pattern--d742a578-d70e-4d0e-96a6-02a9c30204e6",
      "x_panw_coa_u42_panw_product": [
        "Threat Prevention"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--ea152fc4-0689-464d-9297-238e59c4ad9b",
      "created": "2019-07-16T16:31:11.385Z",
      "modified": "2019-07-25T12:33:21.158Z",
      "relationship_type": "uses",
      "description": "Dropped PoisonIvy variant. ",
      "source_ref": "indicator--cf2518ce-3a5b-444b-8044-b2a900949b5c",
      "target_ref": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add"
    },
    {
      "type": "relationship",
      "id": "relationship--edcfe461-63fe-499e-98eb-d4f28f54d2ff",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:15.015Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--9bcdca50-296d-4032-8639-dc8bc56077a3",
      "target_ref": "attack-pattern--d742a578-d70e-4d0e-96a6-02a9c30204e6",
      "x_panw_coa_u42_panw_product": [
        "NGFW"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--eec1f650-2636-4828-bd7d-c8423908a07d",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:15.015Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--a79d2365-61c7-48b9-b024-e2020b99bba0",
      "target_ref": "attack-pattern--d742a578-d70e-4d0e-96a6-02a9c30204e6",
      "x_panw_coa_u42_panw_product": [
        "Wildfire"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--ef3dabcc-b1de-4d09-a35a-68b197909056",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:11.075Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--41a5e724-166d-496a-bfa6-5f7d671c733e",
      "target_ref": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add",
      "x_panw_coa_u42_panw_product": [
        "XSOAR"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--f427ad0b-2531-4c3e-ba75-a33ece79958c",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:15.015Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--49790670-d365-43f8-a906-8e45c3c80f63",
      "target_ref": "attack-pattern--d742a578-d70e-4d0e-96a6-02a9c30204e6",
      "x_panw_coa_u42_panw_product": [
        "Threat Prevention"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--f4f7917a-9378-4a33-9125-65067c7e2ee1",
      "created": "2019-07-16T16:31:11.385Z",
      "modified": "2019-07-25T12:33:21.158Z",
      "relationship_type": "uses",
      "description": "Dropped PoisonIvy variant. ",
      "source_ref": "indicator--fcd372a5-ae48-4c4c-8b39-84b3ae14e5a6",
      "target_ref": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add"
    },
    {
      "type": "relationship",
      "id": "relationship--f7db0bc7-a535-44b4-ba36-d5ea5ac6f71c",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:15.015Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--f4d50de0-ecc5-4f9e-b8f7-214cdfe28d39",
      "target_ref": "attack-pattern--d742a578-d70e-4d0e-96a6-02a9c30204e6",
      "x_panw_coa_u42_panw_product": [
        "Wildfire"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--f8dcb3f5-ae7c-4aae-a508-4cc3ec479ed9",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:15.015Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--a592acb0-98ba-4a8e-a5cf-2e78d2806e75",
      "target_ref": "attack-pattern--d742a578-d70e-4d0e-96a6-02a9c30204e6",
      "x_panw_coa_u42_panw_product": [
        "Wildfire"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--f950a7b7-c7ed-4aab-a32b-5c66185b5655",
      "created": "2019-05-07T17:42:38.256Z",
      "modified": "2019-07-25T12:33:21.157Z",
      "relationship_type": "uses",
      "description": "Compromised site for Watering hole attacks. ",
      "source_ref": "indicator--81bf4b2a-4cbf-4a01-bab1-8cea8ac405c5",
      "target_ref": "attack-pattern--d742a578-d70e-4d0e-96a6-02a9c30204e6"
    },
    {
      "type": "relationship",
      "id": "relationship--fba3936b-0733-4251-a3cd-3708db930e84",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:15.015Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--f4a8da12-c6f0-4a33-ae42-590c5602be99",
      "target_ref": "attack-pattern--d742a578-d70e-4d0e-96a6-02a9c30204e6",
      "x_panw_coa_u42_panw_product": [
        "URL Filtering"
      ]
    },
    {
      "type": "relationship",
      "id": "relationship--febf391a-1d95-4d2d-83d6-876b2a7529a8",
      "created": "2020-06-23T19:50:42.481Z",
      "modified": "2020-06-26T19:00:11.076Z",
      "relationship_type": "mitigates",
      "source_ref": "course-of-action--befa473a-9ac8-4ff8-b0fe-be0e47821896",
      "target_ref": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add",
      "x_panw_coa_u42_panw_product": [
        "Threat Prevention"
      ]
    },
    {
      "type": "report",
      "id": "report--352e36e2-33ad-4065-a080-f13778ce9593",
      "created": "2019-05-01T15:51:07.709Z",
      "modified": "2019-10-15T15:00:35.247Z",
      "name": "Watering Hole Attack Campaign",
      "published": "2019-10-15T15:00:35.247Z",
      "object_refs": [
        "attack-pattern--42e8de7b-37b2-4258-905a-6897815e58e0",
        "attack-pattern--d742a578-d70e-4d0e-96a6-02a9c30204e6",
        "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add",
        "campaign--352e36e2-33ad-4065-a080-f13778ce9593",
        "course-of-action--21ce34c9-4220-41cf-85c7-bc289bb2c79d",
        "course-of-action--28f61b3c-18a6-4991-8a17-7cfcd388136c",
        "course-of-action--2c886776-61fb-487c-a880-41f4b7195627",
        "course-of-action--2fd9769c-5e50-4528-985f-a1d117329991",
        "course-of-action--38519f4f-e6e8-454b-a3f5-b46daef0e316",
        "course-of-action--41a5e724-166d-496a-bfa6-5f7d671c733e",
        "course-of-action--44bfcc9e-cb15-499f-b0fe-3c41e2c2655e",
        "course-of-action--49790670-d365-43f8-a906-8e45c3c80f63",
        "course-of-action--51bcc0dd-f051-4786-aa93-429358ea6238",
        "course-of-action--55e53da8-b2ba-4bba-a641-c5c75a023bb5",
        "course-of-action--5839cd6c-7897-43c4-82f3-5c03096a51c4",
        "course-of-action--5e951942-0565-46f4-b09e-80426812b6b5",
        "course-of-action--60e78a97-dcc6-4d67-a310-ed7f16e0218a",
        "course-of-action--645c6c45-116e-4265-98d2-e30f56325bc6",
        "course-of-action--79fd0d10-6272-4191-8b8d-9c72f19358d0",
        "course-of-action--8190ac5a-8a5e-41bc-85dd-62e0f5cdd2ba",
        "course-of-action--922b1227-c493-43f6-8b4a-ae6d6963eb8b",
        "course-of-action--9bcdca50-296d-4032-8639-dc8bc56077a3",
        "course-of-action--a1294d38-0f0d-4973-a949-f38cccbc7469",
        "course-of-action--a592acb0-98ba-4a8e-a5cf-2e78d2806e75",
        "course-of-action--a79d2365-61c7-48b9-b024-e2020b99bba0",
        "course-of-action--ae18aab6-0a08-4c09-9a97-6c6ef58061a7",
        "course-of-action--b1f31bc6-40cd-4c64-805f-1680eda35801",
        "course-of-action--b4ed79f9-b72c-4423-9a9c-f29134fda870",
        "course-of-action--befa473a-9ac8-4ff8-b0fe-be0e47821896",
        "course-of-action--c45b79a8-2d29-4d8c-95ab-acea7e478e50",
        "course-of-action--c5148c0d-4c4a-4ad6-b2c7-942f9eb91673",
        "course-of-action--d3c39d4c-3074-4350-832e-9eea942ac353",
        "course-of-action--d84f79f8-219c-43cb-a918-ab7dd235413a",
        "course-of-action--dff22e97-a89e-4ff7-b615-0165258bf8d5",
        "course-of-action--ef5f68d8-9522-40b4-890c-31ece644687d",
        "course-of-action--f4a8da12-c6f0-4a33-ae42-590c5602be99",
        "course-of-action--f4d50de0-ecc5-4f9e-b8f7-214cdfe28d39",
        "course-of-action--fd0da09e-a0b2-4018-9476-1a7edd809b59",
        "identity--f24d9056-f704-43ee-b162-ac5744345fa2",
        "indicator--1226ebbd-c85f-4cd1-aa95-914993812bc2",
        "indicator--23dc3ecc-5a82-4fc2-817a-eca4b25dcb74",
        "indicator--2ea18706-2e08-41be-b0d8-0446ac16d14e",
        "indicator--562e634f-b0db-4186-877c-f22561788478",
        "indicator--7400c925-265c-45cd-bbb6-bfde1449520e",
        "indicator--81bf4b2a-4cbf-4a01-bab1-8cea8ac405c5",
        "indicator--99df9df1-c265-404f-8f0f-bedba3d45e97",
        "indicator--b81ea8b1-62ac-4743-912b-75ce8edd98f6",
        "indicator--cf2518ce-3a5b-444b-8044-b2a900949b5c",
        "indicator--f71d79a7-b9ba-4faa-9ee9-b3d49dc01015",
        "indicator--fcd372a5-ae48-4c4c-8b39-84b3ae14e5a6",
        "intrusion-set--90ba5c1f-2704-487c-8da9-523fcd023d5a",
        "malware--c7539b03-c5b9-47e9-a236-4f3b53a3ccfb",
        "relationship--0021f86a-b604-4cbf-b48d-ad778ce6fcf0",
        "relationship--0032cd5c-1284-4852-9ab3-9d23a3c98d36",
        "relationship--04dd51c4-aaa5-4128-bf07-1e8ebfa23681",
        "relationship--068ee331-72ba-45b0-9dc5-e785e116fdb4",
        "relationship--076d5ade-2e17-4fac-9884-78e285587a0b",
        "relationship--10c0838e-c6ee-42d4-aa07-c3310216490d",
        "relationship--13b67387-cd61-47a5-803c-a6c5f77c9e03",
        "relationship--15515310-419b-452d-8040-1f59b9443ae1",
        "relationship--181b970c-5dca-4937-ac0f-30bcca4b4932",
        "relationship--1af23f08-4b44-42ea-8faf-77281714416b",
        "relationship--1bd24773-9d45-470d-bfa6-bdd4ff735a31",
        "relationship--24a16eeb-2ab2-49aa-ade9-1c23bf7da12c",
        "relationship--262bc6f7-1167-4b5f-8f0d-622e9c38ce02",
        "relationship--337e66c7-67aa-4e0c-8d7a-1cf28adeb77f",
        "relationship--352e36e2-33ad-4065-a080-f13778ce9593",
        "relationship--3950e32e-d243-4f21-8cce-7938d4f3c9ed",
        "relationship--3a1e4e8a-b2b3-4b8b-9d9d-08f406482031",
        "relationship--3d924f97-d12f-4cb6-b163-08aac65a84e7",
        "relationship--42e8de7b-37b2-4258-905a-6897815e58e0",
        "relationship--42f7f9f0-37a9-4416-913f-ded7cb6b9013",
        "relationship--449d7ee9-b7b3-4a0f-ba31-d24aea6e1afb",
        "relationship--459c3262-49ba-48cf-86ca-e632cc7994f1",
        "relationship--469e47cb-817d-4e52-b194-df44dd1a4f5e",
        "relationship--49ba3ce9-ac14-4cd7-8c71-8040dc0af86e",
        "relationship--4cf245e5-64ec-4412-b184-f41f914c333e",
        "relationship--50de5812-75d8-4ec0-ae79-27da69b41881",
        "relationship--5387a44c-2972-47cb-bf77-bde968557e20",
        "relationship--59a9e88d-f828-47c3-9f30-c9c5a658dbe0",
        "relationship--5aaad24c-bf6e-4dc4-90bb-18dbbf515626",
        "relationship--5c6da0f1-a447-488f-ae6e-a23d931265a7",
        "relationship--5d22d838-1cb1-4204-9e1a-a55a754ffe59",
        "relationship--5d8a9ab0-8598-4b75-ae57-8e684862cde8",
        "relationship--5e99bd2b-db13-40a1-9a21-ab96a7550beb",
        "relationship--61212ee6-3daf-429d-bd56-d15390130cb5",
        "relationship--64c1592b-1624-49f1-a973-5c340715c0ad",
        "relationship--65626653-b0c1-44be-bf7e-c8bea3afa7cc",
        "relationship--6706e446-ce53-4b02-aafb-50dff2c0015d",
        "relationship--685d35a9-5470-4234-a3af-39167a958782",
        "relationship--6d360481-23c9-42e3-b4ce-cc0f344c68a6",
        "relationship--6f763c9e-736b-4d03-83c1-9bfa1823c18e",
        "relationship--76b2ee51-168c-4270-96de-97e4e22fd98c",
        "relationship--7877f6f7-f6ff-4142-ada6-3b05b8825738",
        "relationship--7926b19e-fde0-4c0b-a9bd-7a3b86a493be",
        "relationship--798d3fdd-590b-4b01-a440-ba27c6d20f0d",
        "relationship--7be13991-f221-48d4-b64d-ef1f343660db",
        "relationship--7c78b490-5275-4de6-8983-5a8c7672eead",
        "relationship--7faf64d7-f4c1-4fa7-a15b-50a9b91cd90f",
        "relationship--828a7d43-0e73-42ec-8edf-64aa679c3208",
        "relationship--850d6f45-7b76-4b1f-bf93-0fa011691b87",
        "relationship--8eab6c90-654b-474c-b40c-2b73170cce50",
        "relationship--91044b6a-b5c4-4f1e-a6ba-6a1682870795",
        "relationship--915f1e1d-f8c4-4c19-b52b-4a574d94dadc",
        "relationship--977f3f9e-e61e-4703-9307-0eb03c7897a6",
        "relationship--a1a1e92e-7e0c-465e-8991-d196f5c519f1",
        "relationship--a3684627-1af3-4943-8040-164ddd781392",
        "relationship--a41f0737-5a35-4ffb-9600-0150b80e28c7",
        "relationship--a9129405-7138-4f23-8743-012672006849",
        "relationship--af661f55-b3f5-40b3-a03d-0d52e9a656fc",
        "relationship--b33c6f4c-ed01-4e83-b184-19c8faf1b8da",
        "relationship--b67115ad-5b05-417a-8930-5e03ae9c33e4",
        "relationship--bb4797cb-ebb7-4ea0-9c83-47cb6f14cdc8",
        "relationship--bc22b40c-ad02-4aa2-81ec-073af2b6efac",
        "relationship--c0f12c46-47dd-4b9e-ae58-9a1ca3cba58e",
        "relationship--c1691e91-4f32-46aa-be96-a98672d15829",
        "relationship--c2293c71-403a-4f70-b96a-3f317dd89e7b",
        "relationship--c75f376a-8f98-4ba8-8b9f-b93e830b8757",
        "relationship--ca49a799-3db5-41e7-b529-d3f3442ab388",
        "relationship--ccee47c3-fa4c-4e4a-b655-7bdeb0e6bb86",
        "relationship--d32a12b9-0939-4e6a-8f36-f87ae65fcf30",
        "relationship--d3ea4e66-7802-4f40-bd25-48931b5a516b",
        "relationship--d553b2f1-c865-4f3e-9343-a0bd3e89678f",
        "relationship--d742a578-d70e-4d0e-96a6-02a9c30204e6",
        "relationship--db2924b9-d352-4d92-8fa4-dd6bf40cc4a5",
        "relationship--de8e6a5f-70cd-4f01-9604-a9cfd6f6e5bc",
        "relationship--de97227d-28fe-4018-a09b-d25d2faeebe8",
        "relationship--deb41095-070d-446a-811a-6ab574fc9022",
        "relationship--df7eee49-8b40-49e5-9a49-22783cc6e2fe",
        "relationship--e0e37ccf-b773-4bb6-b1ac-638f2fea1982",
        "relationship--e3b9b2b3-2f68-4aad-b4ca-319912b75710",
        "relationship--e546809c-0d41-4c7f-9550-9afe35204ac7",
        "relationship--e6919abc-99f9-4c6c-95a5-14761e7b2add",
        "relationship--e77e7044-d492-4e54-a6ec-db96f7407579",
        "relationship--e8357569-3261-4221-b833-480209bb25a4",
        "relationship--e8e21290-dfc5-46ca-9261-5a068d116967",
        "relationship--ea152fc4-0689-464d-9297-238e59c4ad9b",
        "relationship--edcfe461-63fe-499e-98eb-d4f28f54d2ff",
        "relationship--eec1f650-2636-4828-bd7d-c8423908a07d",
        "relationship--ef3dabcc-b1de-4d09-a35a-68b197909056",
        "relationship--f427ad0b-2531-4c3e-ba75-a33ece79958c",
        "relationship--f4f7917a-9378-4a33-9125-65067c7e2ee1",
        "relationship--f7db0bc7-a535-44b4-ba36-d5ea5ac6f71c",
        "relationship--f8dcb3f5-ae7c-4aae-a508-4cc3ec479ed9",
        "relationship--f950a7b7-c7ed-4aab-a32b-5c66185b5655",
        "relationship--fba3936b-0733-4251-a3cd-3708db930e84",
        "relationship--febf391a-1d95-4d2d-83d6-876b2a7529a8"
      ],
      "labels": [
        "campaign"
      ]
    }
  ]
}